{
    "paper_id": "PMC1550560",
    "metadata": {
        "title": "SARS and Population Health Technology",
        "authors": [
            {
                "first": "Gunther",
                "middle": [],
                "last": "Eysenbach",
                "suffix": "",
                "email": "geysenba@uhnres.utoronto.ca",
                "affiliation": {}
            }
        ]
    },
    "body_text": [
        {
            "text": "Severe acute respiratory syndrome (SARS) hit the world on November 16, 2002, when the first cases of atypical pneumonia appeared in the Guangdong Province, south China. The disease quickly spread to Vietnam and Hong Kong, and from there made its way around the globe. The western hemisphere was not spared: about 37 people have died in Canada as of June 30, 2003, all in the Toronto area, and Canada remains the only region outside of Asia with deaths from SARS.",
            "cite_spans": [],
            "section": "Introduction",
            "ref_spans": []
        },
        {
            "text": "With SARS, countless media reports and company press releases promoting information and communication technology (ICT) solutions appeared (Textbox 1). Some technology firms attempted to turn lemons into lemonade by using the crisis to bring their ICT products and services into the media and to public attention. As the number of new SARS cases declines and the dust settles, it is time to ask critical questions, including which of these tools and technologies have proven useful or should be further developed and evaluated in order to be prepared for the next public health emergency.",
            "cite_spans": [],
            "section": "Introduction",
            "ref_spans": []
        },
        {
            "text": "The public health and infectious disease research community widely praised the role of ICT in early detection as well as in fostering global collaboration and information exchange during the SARS epidemic. On March 17, 2003, WHO called upon 11 laboratories in 9 countries to join a collaborative multi-center research project on SARS diagnosis. The network took advantage of e-mail and a secure WHO Web site to share outcomes of investigations of clinical samples, electron-microscope pictures of viruses, sequences of genetic material for virus identification and characterization, and postmortem tissues from SARS cases in real time [1]. Individual departments of affected hospitals also used Web sites and e-mail to rapidly disseminate clinical findings to health professionals [2]. \"This is a form of early warning and communication that would not have been possible if the SARS Virus had appeared ten years ago,\" notes Dr. Kimball of the APEC Emerging Infections Network [3], and Julie Gerberding, director of the US Centers for Disease Control and Prevention, writes in an editorial in the New England Journal of Medicine that \"use of the Internet has sped information exchange and helped overcome the problems presented by asynchrony in the activities of investigators in many time zones\" [4].",
            "cite_spans": [
                {
                    "start": 636,
                    "end": 637,
                    "mention": "1",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 782,
                    "end": 783,
                    "mention": "2",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 977,
                    "end": 978,
                    "mention": "3",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 1297,
                    "end": 1298,
                    "mention": "4",
                    "ref_id": "BIBREF5"
                }
            ],
            "section": "Role of information technology during the SARS epidemic",
            "ref_spans": []
        },
        {
            "text": "Journal editors celebrated themselves and the Internet for being able to publish articles about SARS at the speed of electrons [5]. However, the role of journals — even if with electronic preprint versions and fast track peer-review — dwarfs compared with the role of the Internet in information dissemination of SARS. As of June 30, 2003, PubMed lists 881 articles containing the search words [\"severe acute respiratory syndrome\" OR SARS]. In contrast, Google finds 358000 pages with the phrase \"severe acute respiratory syndrome\" (not counting non-English pages or pages which contain only the abbreviations SARS or SRAS for \"syndrome respiratoire aigu sévère\").",
            "cite_spans": [
                {
                    "start": 128,
                    "end": 129,
                    "mention": "5",
                    "ref_id": "BIBREF6"
                }
            ],
            "section": "Role of information technology during the SARS epidemic",
            "ref_spans": []
        },
        {
            "text": "The World Health Organization (WHO) also praised the role of GPHIN (Global Public Health Intelligence Network) for early detection of SARS, claiming that \"GPHIN provided some of the earliest alerts to the November outbreak in China\" [6]. GPHIN is part of WHOs Global Outbreak Alert and Response Network [7]; it was developed and is operated by Health Canada's Centre for Emergency Preparedness and Response. It is essentially an Internet crawler specialized in detecting news articles indicating unusual events relevant to public health: GPHIN continually scans more than 400 international sources for news of any outbreaks of 31 communicable diseases, as well as articles about natural disasters and drug-resistant pathogens, rather than relying on \"official\" reports from government sources (which may be reluctant to report disease outbreaks to avoid economic disruptions). The approach is obviously insufficient when disease outbreaks occur in developing countries where little information finds its way into news media and the Internet, or in countries where the media a controlled by the government. GPHIN seems to be stretched to its limits (when the author requested access to the system the reply was \"we have now reached our limit on the number of users that can have access to the system\"). GPHIN is currently being upgraded to include more languages, including Chinese (which during the SARS crisis was not yet implemented).",
            "cite_spans": [
                {
                    "start": 234,
                    "end": 235,
                    "mention": "6",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 304,
                    "end": 305,
                    "mention": "7",
                    "ref_id": "BIBREF8"
                }
            ],
            "section": "Role of information technology during the SARS epidemic",
            "ref_spans": []
        },
        {
            "text": "eHealth, consumer health informatics, and public health informatics are emerging fields that have a clear public health aspect, in that they include technologies that can be used to improve the health of entire populations, not just individuals. Population health technology is a recent umbrella term subsuming applications of technologies such as the Internet, wireless devices, mobile phones, smart appliances, or smart homes (domotics) that have a population focus and the potential to improve public health. In principle, all sorts of home-monitoring devices, from digital fever thermometers to asthma-monitoring devices, could be modified to function as early detection systems, ie, to transmit data — wirelessly or through the Internet — to central data-mining facilities, which may detect emerging patterns indicating disease outbreaks. Among the challenges of all of these systems are ethical and privacy concerns — it is a difficult balance between gathering data from thousands of people with being able to track down infected individuals on the one hand, and protecting the privacy of people on the other hand. Hospitals and pharmacies of tomorrow may also feed data into such central data-mining systems. In addition, there may be a role for detecting patterns of information and communication flows on the Internet. At the Centre for Global eHealth Innovation we have been experimenting with monitoring search requests people enter into search engines, to evaluate whether it is possible to detect increases or changes in health-related requests using automatic methods [8]. The sensitivity of such methods for detecting disease outbreaks or bioterrorism attacks remains to be evaluated — in our search term experiment it did not seem to be sensitive enough in the case of SARS.",
            "cite_spans": [
                {
                    "start": 1584,
                    "end": 1585,
                    "mention": "8",
                    "ref_id": "BIBREF9"
                }
            ],
            "section": "Population Health Technology",
            "ref_spans": []
        },
        {
            "text": "In the last week of June, Ontario presented Ottawa with a breakdown of $945 million (Canadian) in SARS-related costs. Those include $395 million for hospitals and health-care institutions for extra staff expenses, protective gear, clinics, and isolation rooms. Another $330 million went to replace lost wages for quarantined health-care workers. Even more serious may be the consequences of the SARS-related \"epidemic of fear\" [9]. Millions of dollars were lost due to missed business — tourists and business travelers staying away from the hot spots. Worse, as in this particular incident hospitals were the hubs of the outbreaks, patients postponed or delayed important hospital visits. It is difficult to estimate how many patients have been harmed by avoiding hospitals — at least outside of China these may be more than those actually killed by the disease. Kelly MacDonald, a University of Toronto infectious-disease expert, estimates that four times as many Ontarians will die from lack of medical attention caused by the SARS outbreak as will die from the disease itself [10]. To understand the epidemiology of fear in the context of population health technology is important for at least two reasons.",
            "cite_spans": [
                {
                    "start": 428,
                    "end": 429,
                    "mention": "9",
                    "ref_id": "BIBREF10"
                },
                {
                    "start": 1080,
                    "end": 1082,
                    "mention": "10",
                    "ref_id": "BIBREF1"
                }
            ],
            "section": "Information Technology and the Epidemiology of Fear",
            "ref_spans": []
        },
        {
            "text": "First, some ICT applications that have been advocated sometimes played a role as a psychological \"duct tape of the war against fear.\" Indeed, Bruce Hicks, group managing director of Sunday Communications, the operator that launched the mobile phone service that alerts subscribers when they are near infected buildings (see above), was quoted as describing his service with these words: \"With the dial of a few digits, subscribers can quickly get the peace of mind they need to go about their everyday lives.\" — speaking to the fact that it is not primarily the spread of SARS but the fear that is addressed by this service. Thermal-imaging scanners set up at airports to screen travelers for signs of SARS may have had a similar role: to assure people that \"something is being done,\" and to prevent economic damages. In fact, there is limited evidence on the sensitivity and specificity of this technology to identify passengers with fever. Information and communication technology can also help to keep the health care system accessible in cases of disease (or fear) outbreaks. For example, Singapore General Hospital, introduced during the SARS crisis an online physiotherapy program allowing physical therapists to remotely monitor patients in their homes. Using a webcam, patients can communicate with their therapists, who can in turn show their patients new exercises and give them feedback on their progress [11].",
            "cite_spans": [
                {
                    "start": 1417,
                    "end": 1419,
                    "mention": "11",
                    "ref_id": "BIBREF2"
                }
            ],
            "section": "Information Technology and the Epidemiology of Fear",
            "ref_spans": []
        },
        {
            "text": "The second reason why we need to understand the epidemiology of fear in the context of population health technology is that some technologies used as early warning system may not be able to discriminate between a true biological epidemic and an epidemic of fear. This is especially true for systems relying on users entering symptoms, systems designed to detect changes in patterns of health care utilization or other databases, or systems analyzing information and communication patterns on the Internet or in news media. Such early-warning systems may pick up changes in collective behavior triggered by a mere epidemic of fear. For example, thousands of New Yorkers buying duct tape did not indicate a bioterrorism attack, but a fear epidemic. Similarly, runs on doctors or pharmacies may either indicate mass hysteria (a highly-prevalent phenomenon in our society), or a bioterrorism attack (a far less prevalent event). The predictive value of such early warning systems is thus inherently low. False positive warnings lead to media reports, and lead to further changes in the public's behavior — a potentially-devastating positive-feedback loop.",
            "cite_spans": [],
            "section": "Information Technology and the Epidemiology of Fear",
            "ref_spans": []
        },
        {
            "text": "The recent SARS outbreak provides an opportunity to analyze and study the use of population health technology, and to learn lessons for future public health emergencies, including acts of bioterrorism. Most importantly, it should be a stimulus to critically evaluate these technologies and to provide directions for further research and development. Population health technology clearly has a vast potential to increase our preparedness for the next public-health emergency, but it also raises many questions related to ethics, libertarian values, and privacy, and has the potential to fuel an epidemic of fear and collective mass hysteria.",
            "cite_spans": [],
            "section": "Conclusions",
            "ref_spans": []
        }
    ],
    "ref_entries": {
        "FIGREF0": {
            "text": "Figure 1: Healthcarelink",
            "type": "figure"
        },
        "FIGREF1": {
            "text": "Figure 2: Advertisements of Sunday Communications in Hong Kong",
            "type": "figure"
        }
    },
    "back_matter": [],
    "bib_entries": {
        "BIBREF0": {
            "title": "",
            "authors": [],
            "year": 2003,
            "venue": "WHO collaborative multi-centre research project on Severe Acute Respiratory Syndrome (SARS) diagnosis",
            "volume": "",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF1": {
            "title": "",
            "authors": [],
            "year": 2003,
            "venue": "Toronto Star",
            "volume": "",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF2": {
            "title": "",
            "authors": [
                {
                    "first": "W",
                    "middle": [],
                    "last": "Tan",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "SGH puts some physio sessions online",
            "volume": "",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF3": {
            "title": "SARS and the modern day pony express (the World Wide Web)",
            "authors": [
                {
                    "first": "James",
                    "middle": [],
                    "last": "Griffith",
                    "suffix": ""
                },
                {
                    "first": "Gregory",
                    "middle": [],
                    "last": "Antonio",
                    "suffix": ""
                },
                {
                    "first": "Anil",
                    "middle": [],
                    "last": "Ahuja",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "AJR Am J Roentgenol",
            "volume": "180",
            "issn": "6",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF4": {
            "title": "",
            "authors": [
                {
                    "first": "AM",
                    "middle": [],
                    "last": "Kimball",
                    "suffix": ""
                },
                {
                    "first": "NF",
                    "middle": [],
                    "last": "Pautler",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "Lessons of SARS: The APEC/EINet Experience",
            "volume": "",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF5": {
            "title": "Faster... but fast enough? Responding to the epidemic of severe acute respiratory syndrome [editorial]",
            "authors": [
                {
                    "first": "JL",
                    "middle": [],
                    "last": "Gerberding",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "N Engl J Med",
            "volume": "348",
            "issn": "20",
            "pages": "2030-2031",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF6": {
            "title": "SARS, the Internet, and the Journal",
            "authors": [
                {
                    "first": "Jeffrey",
                    "middle": [
                        "M"
                    ],
                    "last": "Drazen",
                    "suffix": ""
                },
                {
                    "first": "Edward",
                    "middle": [
                        "W"
                    ],
                    "last": "Campion",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "N Engl J Med",
            "volume": "348",
            "issn": "20",
            "pages": null,
            "other_ids": {
                "DOI": [
                    "10.1056/NEJMe030089"
                ]
            }
        },
        "BIBREF7": {
            "title": "",
            "authors": [],
            "year": 2003,
            "venue": "Severe acute respiratory syndrome (SARS): status of the outbreak and lessons for the immediate future",
            "volume": "",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF8": {
            "title": "Hot spots in a wired world: WHO surveillance of emerging and re-emerging infectious diseases",
            "authors": [
                {
                    "first": "DL",
                    "middle": [],
                    "last": "Heymann",
                    "suffix": ""
                },
                {
                    "first": "GR",
                    "middle": [],
                    "last": "Rodier",
                    "suffix": ""
                }
            ],
            "year": 2001,
            "venue": "Lancet Infect Dis",
            "volume": "1",
            "issn": "5",
            "pages": "345-353",
            "other_ids": {
                "DOI": [
                    "10.1016/S1473-3099(01)00148-7"
                ]
            }
        },
        "BIBREF9": {
            "title": "What is the prevalence of health-related searches on the World Wide Web? Qualitative and quantitative analysis of search engine queries on the Internet",
            "authors": [
                {
                    "first": "G",
                    "middle": [],
                    "last": "Eysenbach",
                    "suffix": ""
                },
                {
                    "first": "C",
                    "middle": [],
                    "last": "Kohler",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "Proc AMIA Annu Fall Symp",
            "volume": "",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF10": {
            "title": "",
            "authors": [
                {
                    "first": "F",
                    "middle": [],
                    "last": "Furedi",
                    "suffix": ""
                }
            ],
            "year": null,
            "venue": "Epidemic of fear. Spiked 2002",
            "volume": "",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        }
    }
}