{
    "paper_id": "PMC1563757",
    "metadata": {
        "title": "Model of a Putative Pore: The Pentameric α-Helical Bundle of SARS Coronavirus E Protein in Lipid Bilayers",
        "authors": [
            {
                "first": "Jaume",
                "middle": [],
                "last": "Torres",
                "suffix": "",
                "email": null,
                "affiliation": {}
            },
            {
                "first": "Krupakar",
                "middle": [],
                "last": "Parthasarathy",
                "suffix": "",
                "email": null,
                "affiliation": {}
            },
            {
                "first": "Xin",
                "middle": [],
                "last": "Lin",
                "suffix": "",
                "email": null,
                "affiliation": {}
            },
            {
                "first": "Rathi",
                "middle": [],
                "last": "Saravanan",
                "suffix": "",
                "email": null,
                "affiliation": {}
            },
            {
                "first": "Andreas",
                "middle": [],
                "last": "Kukol",
                "suffix": "",
                "email": null,
                "affiliation": {}
            },
            {
                "first": "Ding",
                "middle": [
                    "Xiang"
                ],
                "last": "Liu",
                "suffix": "",
                "email": null,
                "affiliation": {}
            }
        ]
    },
    "body_text": [
        {
            "text": "The causative agent of the severe acute respiratory syndrome (SARS) (1) is a member of the family Coronaviridae, which cause most common colds in humans and are responsible for serious diseases in other animal species. The lipid bilayer that surrounds these viruses typically embeds three proteins: spike (S), membrane (M), and envelope (E) protein. These proteins are studied for their important role in receptor binding and virion budding.",
            "cite_spans": [
                {
                    "start": 69,
                    "end": 70,
                    "mention": "1",
                    "ref_id": "BIBREF0"
                }
            ],
            "section": "INTRODUCTION",
            "ref_spans": []
        },
        {
            "text": "The E protein of the SARS-CoV virus is a small, 76 amino acid, integral membrane protein with one putative transmembrane α-helical (TMH) hydrophobic domain, 20–30 amino acids long, flanked by a short N-terminus (<10 amino acids) and a longer C-terminus tail, both more hydrophilic. This protein is very important for virus morphogenesis, to the point that it has been found to be critical for viral budding in mouse hepatitis virus (MHV) (2). Also, in many coronaviruses, coexpression of M and E proteins, which probably interact via their cytoplasmic domains in pre-Golgi compartments (3), is necessary for morphogenesis (4,5).",
            "cite_spans": [
                {
                    "start": 439,
                    "end": 440,
                    "mention": "2",
                    "ref_id": "BIBREF11"
                },
                {
                    "start": 587,
                    "end": 588,
                    "mention": "3",
                    "ref_id": "BIBREF22"
                },
                {
                    "start": 623,
                    "end": 624,
                    "mention": "4",
                    "ref_id": "BIBREF33"
                },
                {
                    "start": 625,
                    "end": 626,
                    "mention": "5",
                    "ref_id": "BIBREF40"
                }
            ],
            "section": "INTRODUCTION",
            "ref_spans": []
        },
        {
            "text": "A further role suggested for protein E is to promote apoptosis (6,7). It has also been found that SARS-CoV E protein can alter membrane permeability when expressed in Escherichia coli and mammalian cells (8) and in vitro cation-selective ion channel formation has been reported using a totally synthetic polypeptide (9). This apparent ability to form channels suggests that E protein is able to form TM homooligomers, as reported in other similar systems (10,11).",
            "cite_spans": [
                {
                    "start": 64,
                    "end": 65,
                    "mention": "6",
                    "ref_id": "BIBREF41"
                },
                {
                    "start": 66,
                    "end": 67,
                    "mention": "7",
                    "ref_id": "BIBREF42"
                },
                {
                    "start": 205,
                    "end": 206,
                    "mention": "8",
                    "ref_id": "BIBREF43"
                },
                {
                    "start": 317,
                    "end": 318,
                    "mention": "9",
                    "ref_id": "BIBREF44"
                },
                {
                    "start": 456,
                    "end": 458,
                    "mention": "10",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 459,
                    "end": 461,
                    "mention": "11",
                    "ref_id": "BIBREF2"
                }
            ],
            "section": "INTRODUCTION",
            "ref_spans": []
        },
        {
            "text": "To determine if, and which, TM oligomers are present in SARS-CoV E, we used recently (12) a computational method that filters nonnative interactions with the help of evolutionary conservation data (13). A search of the possible interhelical interactions in the transmembrane domain of E protein (ETM) was performed using a total of 17 homologs of SARS-CoV E, present in other viruses. We showed that only three homooligomeric models had been conserved by evolution of the viruses: a dimer, a trimer, and two similar pentamers. Due to the special nature of our simulation, totally independent from experimental measurements, and only dependent on the disturbing effect of conservative mutations on non native models, we predicted (12) that all these oligomers should be found in vivo.",
            "cite_spans": [
                {
                    "start": 86,
                    "end": 88,
                    "mention": "12",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 198,
                    "end": 200,
                    "mention": "13",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 730,
                    "end": 732,
                    "mention": "12",
                    "ref_id": "BIBREF3"
                }
            ],
            "section": "INTRODUCTION",
            "ref_spans": []
        },
        {
            "text": "This conclusion was consistent with previous data for expression of whole protein E in E. coli and mammalian cells, where dimers and trimers in SDS were observed, although no pentamers could be detected (8). We also reported in the same study (12) that these three types of oligomers of synthetic ETM were stable in SDS, which suggested a stabilizing function at the TM domain. Clearly, of these oligomeric forms, only a pentamer is consistent with the formation of a pore that could account for the ion channel behavior observed in previous reports (9), but at present the oligomeric form of protein E, and ETM, in lipid bilayers is not yet known.",
            "cite_spans": [
                {
                    "start": 204,
                    "end": 205,
                    "mention": "8",
                    "ref_id": "BIBREF43"
                },
                {
                    "start": 244,
                    "end": 246,
                    "mention": "12",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 551,
                    "end": 552,
                    "mention": "9",
                    "ref_id": "BIBREF44"
                }
            ],
            "section": "INTRODUCTION",
            "ref_spans": []
        },
        {
            "text": "Herein, we have attacked this problem examining the structure of isotopically labeled ETM when incorporated in model lipid bilayers using polarized attenuated total reflection Fourier Transform infrared spectroscopy (PATIR-FTIR). Specifically, we have synthesized ETM introducing a labeled carbonyl (13C=18O) (14) at various positions (15), for a total of nine residues along the ETM sequence. We have then determined the orientation in space of these labeled peptidic carbonyl groups using the theory of site specific infrared dichroism (SSID) (16). Like any orientational technique, SSID has certain limitations. First, it requires a certain order of the sample, and therefore is not applicable to proteins in solution. Also, it requires a known periodicity in the sample, which is found in α-helical segments. Finally, the requirement for discrimination between neighboring peptide carbonyl orientations makes it unsuitable when α-helices are either completely parallel or perpendicular to the membrane normal. SSID is therefore ideal to study TMH bundles, where all the above conditions are met (14,15,17).",
            "cite_spans": [
                {
                    "start": 310,
                    "end": 312,
                    "mention": "14",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 336,
                    "end": 338,
                    "mention": "15",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 546,
                    "end": 548,
                    "mention": "16",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 1100,
                    "end": 1102,
                    "mention": "14",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 1103,
                    "end": 1105,
                    "mention": "15",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 1106,
                    "end": 1108,
                    "mention": "17",
                    "ref_id": "BIBREF8"
                }
            ],
            "section": "INTRODUCTION",
            "ref_spans": []
        },
        {
            "text": "We note that in several reports (14,16,18–20), we have used only two labeled residues, at consecutive positions, to give support to a particular orientation. This is appropriate when alternative models are separated by ω angles of at least 45°, because the error in ω using SSID is usually 10–20°. A more thorough validation of a particular model, however, requires a multiple labeling approach so that experimental values and predicted model can be compared at multiple sites, as reported previously for CD3ζ (15).",
            "cite_spans": [
                {
                    "start": 33,
                    "end": 35,
                    "mention": "14",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 36,
                    "end": 38,
                    "mention": "16",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 39,
                    "end": 41,
                    "mention": "18",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 42,
                    "end": 44,
                    "mention": "20",
                    "ref_id": "BIBREF12"
                },
                {
                    "start": 511,
                    "end": 513,
                    "mention": "15",
                    "ref_id": "BIBREF6"
                }
            ],
            "section": "INTRODUCTION",
            "ref_spans": []
        },
        {
            "text": "As in previous work (15), we have compared experimental versus predicted tilt and rotational orientation of the peptide. For the predicted values, we used those obtained from the evolutionarily conserved models during molecular dynamics simulations (12). Additionally, we have again addressed the problem of the oligomerization of E protein, i.e., the complete polypeptide, when expressed in E. coli. Our results provide an important insight into the mode of organization of E protein in lipid bilayers.",
            "cite_spans": [
                {
                    "start": 21,
                    "end": 23,
                    "mention": "15",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 250,
                    "end": 252,
                    "mention": "12",
                    "ref_id": "BIBREF3"
                }
            ],
            "section": "INTRODUCTION",
            "ref_spans": []
        },
        {
            "text": "Plasmids of full length C-terminal Histidine tag fused SARS-CoV E protein cloned in a pET 24a vector previously described (8) were transformed into E. coli strain BL21DE3 pLysS. A single colony was grown in Luria Broth medium until the absorbance reached 0.4 at 600 nm. The culture was induced with 0.5 mM IPTG, and a part of the culture was transferred to a fresh culture vial as uninduced fraction. The induced and uninduced cultures were further incubated at 25°C for 6 hr.",
            "cite_spans": [
                {
                    "start": 123,
                    "end": 124,
                    "mention": "8",
                    "ref_id": "BIBREF43"
                }
            ],
            "section": "Expression of SARS-CoV E protein in E.coli ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": []
        },
        {
            "text": "Total cell lysate from the uninduced and induced fractions were prepared by sonication, and the slurry obtained was mixed with 2× SDS loading buffer (with 150 mM DTT and 2% SDS) and subjected to 15% SDS-PAGE. Proteins were transferred to nitrocellulose membrane (Pierce, Rockford, IL) and blocked overnight at 4°C in blocking solution (5% fat free milk solution in PBS pH 7.4). The membrane was incubated with a 1:1000 diluted primary antibody (anti-His tag) in blocking solution for 1 h at room temperature. After three washings with PBST, the membrane was incubated with 1:2000 diluted secondary antibody (anti rabbit HRP conjugate DAKO) in blocking solution for 1 h at room temperature. After washing for three times with PBST, the proteins were detected with a chemiluminescence detection kit (West Pico, Pierce) according to the manufacturer protocol.",
            "cite_spans": [],
            "section": "Western blot analysis ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": []
        },
        {
            "text": "Amino acids labeled with carbonyl 13C=18O were obtained as described previously (14,21). The amino acids were then derivatized with 9-fluorenyl-methyloxycarbonyl (FMOC) (22).",
            "cite_spans": [
                {
                    "start": 81,
                    "end": 83,
                    "mention": "14",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 84,
                    "end": 86,
                    "mention": "21",
                    "ref_id": "BIBREF13"
                },
                {
                    "start": 170,
                    "end": 172,
                    "mention": "22",
                    "ref_id": "BIBREF14"
                }
            ],
            "section": "Preparation of labels and peptides ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": []
        },
        {
            "text": "The peptides corresponding to ETM (Fig. 1 A) were synthesized using standard solid phase FMOC chemistry (Intavis ResPep (Gladbach, Germany) peptide synthesizer), from residue 9 to 35, adding two lysine (K) residues to both N- and C-termini (Fig. 1 B) to increase their solubility (12). The peptides were cleaved from the resin with trifluoroacetic acid (TFA) and lyophilized. The lyophilized peptides were purified by HPLC and analyzed by SDS-PAGE as described previously (12). Lyophilization was performed always in the presence of HCl (typically at an approximate molar ratio 20:1, HCl/peptide) to avoid the formation of peptide-TFA adducts; consequently, the typical TFA band at ∼1685 cm−1 was not observed in the amide I region. Peptide purity was further confirmed by mass spectrometry. During the synthesis of ETM, an amino acid bearing a 13C=18O carbonyl group was introduced at a specific position (Fig. 1 B, open circles). A mutation was introduced in two of the peptides, N15A and F23A (Fig. 1 B, residues underlined). In the first case (N15A), this was done to observe if Asn substitution had a critical destabilizing effect on the oligomers, because Asn-Asn interactions were predicted to be present in all evolutionarily conserved oligomeric models (12). The second mutation, F23A, was assumed to be critical in view of its suggested central role in the formation of a putative palindromic helical hairpin (23).",
            "cite_spans": [
                {
                    "start": 281,
                    "end": 283,
                    "mention": "12",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 473,
                    "end": 475,
                    "mention": "12",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 1263,
                    "end": 1265,
                    "mention": "12",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 1420,
                    "end": 1422,
                    "mention": "23",
                    "ref_id": "BIBREF15"
                }
            ],
            "section": "Preparation of labels and peptides ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": [
                {
                    "start": 35,
                    "end": 43,
                    "mention": "Fig. 1 A",
                    "ref_id": "FIGREF0"
                },
                {
                    "start": 241,
                    "end": 249,
                    "mention": "Fig. 1 B",
                    "ref_id": "FIGREF0"
                },
                {
                    "start": 907,
                    "end": 915,
                    "mention": "Fig. 1 B",
                    "ref_id": "FIGREF0"
                },
                {
                    "start": 997,
                    "end": 1005,
                    "mention": "Fig. 1 B",
                    "ref_id": "FIGREF0"
                }
            ]
        },
        {
            "text": "As a control, we used peptides that are α-helical in lipid bilayers, with their C- and N-terminus on opposite sides of the membrane, ∼25 residues buried in the membrane, and which are not known to disrupt liposome integrity. These TM peptides, of integrin β2 (β2-TM), integrin αM (αM-TM) and the component of the T-cell receptor, CD3ζ (CD3 ζ-TM), were synthesized without any labels (Fig. 1 C) and purified as described above.",
            "cite_spans": [],
            "section": "Preparation of labels and peptides ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": [
                {
                    "start": 384,
                    "end": 392,
                    "mention": "Fig. 1 C",
                    "ref_id": "FIGREF0"
                }
            ]
        },
        {
            "text": "The nitrile-derivatized amino acid, 4-cyano-phenylalanine (Phe-CN, Sigma-Aldrich, St. Louis, MO) was introduced during the FMOC synthesis in three separate peptides at positions F20, F23, or F26 (Fig. 1 B, solid circles).",
            "cite_spans": [],
            "section": "Cyano-phenylalanine labeling ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": [
                {
                    "start": 196,
                    "end": 204,
                    "mention": "Fig. 1 B",
                    "ref_id": "FIGREF0"
                }
            ]
        },
        {
            "text": "Unilamellar liposomes of predefined size were obtained as described previously (24). Briefly, multilamellar liposomes were obtained by mixing lipid and water and were extruded 30 times through a 200-nm pore polycarbonate filter using a mini-extruder (Avanti Polar Lipids, Alabaster, AL). DMPC (1,2-dimyristoyl-sn-glycero-3-phosphocholine, Avanti Polar Lipids) liposomes containing ETM, β2-TM, αM-TM, or CD3-ζ-TM were prepared by adding the peptide to the lipid (15:1 DMPC/peptide molar ratio) prior extrusion. Typically, 1 mg of dry peptide was mixed with DMPC and 1 ml of HFIP (1,1,1,3,3,3-hexafluoro-2-propanol, Merck, Darmstadt, Germany). The solvent was evaporated with a rotary evaporator, before addition of 1 ml of H2O. Homogeneity in the diameter of the extruded liposomes was assessed using Dynamic Light Scattering (DLS), which was performed using a 90 Plus particle size analyzer (Brookhaven Instruments, Holtsville, NY).",
            "cite_spans": [
                {
                    "start": 80,
                    "end": 82,
                    "mention": "24",
                    "ref_id": "BIBREF16"
                }
            ],
            "section": "Preparation of liposomes ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": []
        },
        {
            "text": "Infrared spectra were recorded on a Nicolet Nexus spectrometer (Madison, WI) purged with N2 and equipped with a MCT/A detector, cooled with liquid nitrogen. Attenuated total reflection (ATR) spectra were measured with a 25-reflections ATR accessory from Graseby Specac (Kent, UK) and a wire grid polarizer (0.25 μm, Graseby Specac). A total of 200 interferograms collected at a resolution of 4 cm−1 were averaged for every sample and processed with 1 point zero filling and Happ-Genzel apodization. The peptide (typically ∼3 mg) was reconstituted in a 15:1 DMPC/peptide molar ratio (14) and applied onto a trapezoidal (50 mm × 2 mm × 20 mm) Ge internal reflection element (IRE). A dry, or D2O saturated, N2 stream flowing through the ATR compartment (14) was used to remove bulk water or to achieve D2O exchange, respectively.",
            "cite_spans": [
                {
                    "start": 583,
                    "end": 585,
                    "mention": "14",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 751,
                    "end": 753,
                    "mention": "14",
                    "ref_id": "BIBREF5"
                }
            ],
            "section": "Data collection and sample preparation for ATR-FTIR ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": []
        },
        {
            "text": "The percentage of isotopic (hydrogen/deuterium, H/D) exchange was calculated from the area ratio Amide II /Amide I, using nonpolarized spectra, before and after exchange in D2O, as described previously (25). Non polarized spectra were obtained from the parallel (‖) and perpendicular (⊥) ATR polarized spectra, using the expression 1 × (‖) + 1.44 × (⊥), as described previously (26).",
            "cite_spans": [
                {
                    "start": 203,
                    "end": 205,
                    "mention": "25",
                    "ref_id": "BIBREF17"
                },
                {
                    "start": 379,
                    "end": 381,
                    "mention": "26",
                    "ref_id": "BIBREF18"
                }
            ],
            "section": "H/D exchange ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": []
        },
        {
            "text": "The data was analyzed according to the theory of site-specific dichroism (SSID) presented in detail elsewhere (16). SSID uses the fact that the measured dichroic ratio of a particular transition dipole moment, e.g., peptidic C=O stretching, is a function of its spatial orientation, defined by tilt β and rotational pitch angle ω (see Fig. 1 D), which is defined arbitrarily as 0° when the transition dipole moment, the helix director, and the z axis all reside in a single plane (16). The angle α between the transition dipole moment of the vibrational transition and the helix axis is known from fiber diffraction studies (27), and was taken as 39° for the peptidic C=O bond and 29° for the N-H bond (28). The values for the electric field components, ɛx, ɛy, and ɛz, were those calculated according to a thick film approximation (29).",
            "cite_spans": [
                {
                    "start": 111,
                    "end": 113,
                    "mention": "16",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 481,
                    "end": 483,
                    "mention": "16",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 625,
                    "end": 627,
                    "mention": "27",
                    "ref_id": "BIBREF19"
                },
                {
                    "start": 703,
                    "end": 705,
                    "mention": "28",
                    "ref_id": "BIBREF20"
                },
                {
                    "start": 833,
                    "end": 835,
                    "mention": "29",
                    "ref_id": "BIBREF21"
                }
            ],
            "section": "Analysis of infrared data ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": [
                {
                    "start": 335,
                    "end": 343,
                    "mention": "Fig. 1 D",
                    "ref_id": "FIGREF0"
                }
            ]
        },
        {
            "text": "Dichroic ratios were calculated as the ratio between the integrated absorptions of the spectra collected with parallel and perpendicular polarized light. The area of the amide A was calculated by integration of the band centered at ∼3300 cm−1, between 3200 and 3400 cm−1 (14) when the sample was equilibrated in D2O. In these conditions, this band corresponds only to the membrane-embedded part of ETM. The absorption corresponding to the label, i.e., the 13C=18O carbonyl stretching vibration, was obtained integrating the band centered at ∼1590 cm−1 (15,16). Thus, from each measurement, two different dichroic ratios, from amide A (RHelix) and label (Rsite), were obtained (Eqs. 1 and 2, respectively) (16).",
            "cite_spans": [
                {
                    "start": 272,
                    "end": 274,
                    "mention": "14",
                    "ref_id": "BIBREF5"
                },
                {
                    "start": 553,
                    "end": 555,
                    "mention": "15",
                    "ref_id": "BIBREF6"
                },
                {
                    "start": 556,
                    "end": 558,
                    "mention": "16",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 706,
                    "end": 708,
                    "mention": "16",
                    "ref_id": "BIBREF7"
                }
            ],
            "section": "Analysis of infrared data ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": []
        },
        {
            "text": "The first (RHelix, Eq. 1) is the composite dichroism that corresponds to all membrane-embedded amide N-H bonds in the helical structure for sample i. This dichroism is independent of ω and dependent solely on β and the fractional order of the preparation, fi. This fractional order is 1 if the sample is completely ordered, and 0 if randomly oriented (16). The parameters Kx,y, or z are the rotationally averaged, integrated absorption coefficients, whereas Kx,y, or z (ω) refers to the absorption coefficient at a specific ω angle.(1)\\documentclass[10pt]{article}\n\\usepackage{amsmath}\n\\usepackage{wasysym} \n\\usepackage{amsfonts} \n\\usepackage{amssymb} \n\\usepackage{amsbsy}\n\\usepackage{mathrsfs}\n\\pagestyle{empty}\n%% http://web.image.ufl.edu/help/latex/margins.shtml\n\\oddsidemargin -1.0in\n\n\\begin{document}\n\\begin{equation*}R_{{\\mathrm{Helix}}_{{\\mathrm{i}}}}({\\beta},f_{{\\mathrm{i}}})=\\frac{e_{{\\mathrm{z}}}^{2}(f_{{\\mathrm{i}}}K_{{\\mathrm{z}}}+\\displaystyle\\frac{1-f_{{\\mathrm{i}}}}{3})+e_{{\\mathrm{x}}}^{2}(f_{{\\mathrm{i}}}K_{{\\mathrm{x}}}+\\displaystyle\\frac{1-f_{{\\mathrm{i}}}}{3})}{e_{{\\mathrm{y}}}^{2}(f_{{\\mathrm{i}}}K_{{\\mathrm{y}}}+\\displaystyle\\frac{1-f_{{\\mathrm{i}}}}{3})}\\end{equation*}\\end{document}(2)\\documentclass[10pt]{article}\n\\usepackage{amsmath}\n\\usepackage{wasysym} \n\\usepackage{amsfonts} \n\\usepackage{amssymb} \n\\usepackage{amsbsy}\n\\usepackage{mathrsfs}\n\\pagestyle{empty}\n%% http://web.image.ufl.edu/help/latex/margins.shtml\n\\oddsidemargin -1.0in\n\n\\begin{document}\n\\begin{equation*}R_{{\\mathrm{Sites}}_{{\\mathrm{i}}}}({\\beta},f_{{\\mathrm{i}}},{\\omega})=\\frac{e_{{\\mathrm{z}}}^{2}(f_{{\\mathrm{i}}}K_{{\\mathrm{z}}}({\\omega})+\\displaystyle\\frac{1-f_{{\\mathrm{i}}}}{3})+e_{{\\mathrm{x}}}^{2}(f_{{\\mathrm{i}}}K_{{\\mathrm{x}}}({\\omega})+\\displaystyle\\frac{1-f_{{\\mathrm{i}}}}{3})}{e_{{\\mathrm{y}}}^{2}(f_{{\\mathrm{i}}}K_{{\\mathrm{y}}}({\\omega})+\\displaystyle\\frac{1-f_{{\\mathrm{i}}}}{3})}.\\end{equation*}\\end{document}",
            "cite_spans": [
                {
                    "start": 352,
                    "end": 354,
                    "mention": "16",
                    "ref_id": "BIBREF7"
                }
            ],
            "section": "Analysis of infrared data ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": []
        },
        {
            "text": "The other dichroic ratio (Rsite, Eq. 2) corresponds to the isotopic label, centered at ∼1590 cm−1, which depends on three parameters: ωsite, β, and fi.",
            "cite_spans": [],
            "section": "Analysis of infrared data ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": []
        },
        {
            "text": "These two equations are not sufficient to obtain β, ωsite, and fi (three unknowns), therefore a second label is inserted in a different sample j, either immediately before or after the first label (16). There are 3.6 residues per turn in a canonical α-helix, therefore Δω between consecutive residues is assumed to be 100°. Thus, with the additional labeled sample, two additional equations can be obtained, RHelixj and RSitej, dependent on (β, fj) and (β, ω + 100°, fj), respectively. Solving simultaneously the four equations RHelixi, RHelixj, RSitei, and RSitej for each i and j pair, yields βij, ωij, fi, and fj, where βij and ωij are the results obtained from the combinations of sample i and sample j. These nonlinear equations were solved with Newton's method as implemented in the FindRoot function in Mathematica 5.0 (Wolfram Research, Champaign, IL). The final values of β and ω for a particular pair of labels (i, j) were obtained by averaging (at least three measurements) βij and ωij, respectively.",
            "cite_spans": [
                {
                    "start": 198,
                    "end": 200,
                    "mention": "16",
                    "ref_id": "BIBREF7"
                }
            ],
            "section": "Analysis of infrared data ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": []
        },
        {
            "text": "A total of 27 sets of dichroic ratios (Rhelix, Rsite) were obtained (for each of the 9 labeled peptides in Fig. 1 B, three independent preparations were measured). As described above, these values were combined in consecutive labels whenever possible, i.e., (i, i + 1) so that the error in the assumption Δω = 100° was a small as possible. In other cases combinations (i, i + 2) or (i, i + 3) using Δω of 200° or 300°, respectively was also tested. Specifically, the combinations used were V17/L18, L18/L19, L19/L21, L21/A22, A22/A23, A23/V24, V24/L27, and L27/L28. These combinations were used to obtain helix tilt, β, and rotational orientation ω at each i-labeled residue, as well as the contribution of disorder (f) in the samples (15), which was usually 0.7–0.9, depending on the sample.",
            "cite_spans": [
                {
                    "start": 736,
                    "end": 738,
                    "mention": "15",
                    "ref_id": "BIBREF6"
                }
            ],
            "section": "Analysis of infrared data ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": [
                {
                    "start": 107,
                    "end": 115,
                    "mention": "Fig. 1 B",
                    "ref_id": "FIGREF0"
                }
            ]
        },
        {
            "text": "To visualize the allowed values (ω, β) of a specific labeled residue for a particular measurement (Rhelix, Rsite), we used the reasonable assumption that the disorder, f, of a particular preparation, is the same for the α-helix and for its labeled site. Thus, we first plotted the allowed values of f as a function of ω and β for the measured Rsite. Second, we plotted a similar graph (f as a function of ω and β) for the measured Rhelix. As f should be the same for both helix and site, because they belong to the same sample, we obtained the intersection values of these two surfaces and projected them in the (ω,β) plane. Thus, each pair of dichroic ratios obtained in a particular preparation (Rhelix, Rsite) is represented by a curve with all the allowed values of ω and β for that particular labeled residue.",
            "cite_spans": [],
            "section": "Visualization of orientational data ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": []
        },
        {
            "text": "It can be shown that when Rhelix < Rsite and Rhelix > Rsite, this projection will be centered at 0° and 180°, respectively; for example, the curves for the samples with label at V17 and L18. In both cases Rhelix < Rsite (Table 1) therefore, the “smiles” for the two residues should be centered initially at 0°, but because Δω is 100°, we shift the “smiles” for L18, 100° to the left. The coordinates ω17 and β (for residues 17 and 18) can be found at the intersection of the two curves. The same strategy was followed for other combinations of labels, shifting the “smiles” of the second label to the left, according to Δω, and finding the intersection of the curves.",
            "cite_spans": [],
            "section": "Visualization of orientational data ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": [
                {
                    "start": 221,
                    "end": 228,
                    "mention": "Table 1",
                    "ref_id": "TABREF0"
                }
            ]
        },
        {
            "text": "The predicted values for (ω,β) were obtained from the corresponding conserved model in the molecular dynamics simulations reported previously (12), calculating the values (ω,β) for each monomer, and averaging for all the monomers in the oligomer.",
            "cite_spans": [
                {
                    "start": 143,
                    "end": 145,
                    "mention": "12",
                    "ref_id": "BIBREF3"
                }
            ],
            "section": "Visualization of orientational data ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": []
        },
        {
            "text": "The dimensions of the pore for the pentameric model consistent with the experimental data were calculated using the software HOLE (30).",
            "cite_spans": [
                {
                    "start": 131,
                    "end": 133,
                    "mention": "30",
                    "ref_id": "BIBREF23"
                }
            ],
            "section": "Pore calculations ::: EXPERIMENTAL PROCEDURES",
            "ref_spans": []
        },
        {
            "text": "Electrophoresis performed with all the peptides shown in Fig. 1 B were identical as those obtained previously (12), showing bands consistent with dimers, trimers, and pentamers (see Fig. 2). These oligomers were present even in the case of the a priori critical mutants N15A and F23A (Fig. 1 B, underlined). These two mutants were synthesized because they could affect oligomerization via two possible mechanisms: N15 might provide stabilization for the TM oligomers via interchain hydrogen bonds (31,32), whereas F23 has been suggested to have a central role in the formation of a putative short hairpin of ETM (23). Intriguingly, we did not find a change in oligomerization pattern or electrophoretic mobility in any of these mutants, indicating that these two residues, N15 and F23, are not essential for ETM oligomerization in the presence of SDS.",
            "cite_spans": [
                {
                    "start": 111,
                    "end": 113,
                    "mention": "12",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 498,
                    "end": 500,
                    "mention": "31",
                    "ref_id": "BIBREF24"
                },
                {
                    "start": 501,
                    "end": 503,
                    "mention": "32",
                    "ref_id": "BIBREF25"
                },
                {
                    "start": 613,
                    "end": 615,
                    "mention": "23",
                    "ref_id": "BIBREF15"
                }
            ],
            "section": "Electrophoresis ::: RESULTS",
            "ref_spans": [
                {
                    "start": 57,
                    "end": 65,
                    "mention": "Fig. 1 B",
                    "ref_id": "FIGREF0"
                },
                {
                    "start": 182,
                    "end": 188,
                    "mention": "Fig. 2",
                    "ref_id": "FIGREF1"
                },
                {
                    "start": 285,
                    "end": 293,
                    "mention": "Fig. 1 B",
                    "ref_id": "FIGREF0"
                }
            ]
        },
        {
            "text": "Previous reports (23) have suggested that ETM inserts into lipid bilayers as a short hairpin and it may induce dramatic morphological changes in lipid bilayers.",
            "cite_spans": [
                {
                    "start": 18,
                    "end": 20,
                    "mention": "23",
                    "ref_id": "BIBREF15"
                }
            ],
            "section": "Liposome morphology ::: RESULTS",
            "ref_spans": []
        },
        {
            "text": "To test this, we used dynamic light scattering (DLS) to monitor possible morphological changes of DMPC liposomes incorporating ETM, as compared to a), liposomes without peptide or b), liposomes containing a typical TMH peptide, e.g., integrin β2-TM (see Fig. 1 C). In all three cases, the calculated diameter of the liposomes was ∼170 nm (168.5 ± 1 nm, 168 ± 2 nm, and 170.5 ± 1.5 nm, respectively), which indicates no dramatic disturbing effect of ETM on liposome morphology.",
            "cite_spans": [],
            "section": "Liposome morphology ::: RESULTS",
            "ref_spans": [
                {
                    "start": 254,
                    "end": 262,
                    "mention": "Fig. 1 C",
                    "ref_id": "FIGREF0"
                }
            ]
        },
        {
            "text": "Representative infrared spectra of isotopically labeled ETM in DMPC lipid bilayers are shown in Fig. 3. As reported previously (23), the shape of the amide I absorption band, with a maximum at 1657 cm−1, is indicative of a predominant α-helical structure (33). Examination of the amide I and II bands in Fig. 3 A indicates that the percentage of hydrogen/deuterium (H/D) exchange of ETM amide groups was small (17 ± 2%), which indicates that ∼26 residues are membrane-embedded. A similar number of exchange-protected residues (25–26) was obtained with the peptides control (shown in Fig. 1 C, not shown). These results suggest that ETM and the TMH peptides shown in Fig. 1 C share the same topology, i.e., that of a regular, slightly tilted, TMH.",
            "cite_spans": [
                {
                    "start": 128,
                    "end": 130,
                    "mention": "23",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 256,
                    "end": 258,
                    "mention": "33",
                    "ref_id": "BIBREF26"
                },
                {
                    "start": 527,
                    "end": 529,
                    "mention": "25",
                    "ref_id": "BIBREF17"
                },
                {
                    "start": 530,
                    "end": 532,
                    "mention": "26",
                    "ref_id": "BIBREF18"
                }
            ],
            "section": "ETM hydrogen/deuterium exchange ::: RESULTS",
            "ref_spans": [
                {
                    "start": 96,
                    "end": 102,
                    "mention": "Fig. 3",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 304,
                    "end": 312,
                    "mention": "Fig. 3 A",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 583,
                    "end": 591,
                    "mention": "Fig. 1 C",
                    "ref_id": "FIGREF0"
                },
                {
                    "start": 666,
                    "end": 674,
                    "mention": "Fig. 1 C",
                    "ref_id": "FIGREF0"
                }
            ]
        },
        {
            "text": "After confirming that ETM is inserted, and α-helical, in lipid bilayers, we investigated the tilt and rotational orientation of the peptide, comparing dichroic experimental data and predicted orientation (see Experimental Procedures) from the computational models (34). An example of the infrared dichroic data obtained at two polarizations (see Experimental Procedures) is shown for the peptide labeled at A22, for amide I and site (Fig. 3 B) and for amide A (Fig. 3 C). Spectra for other labeled peptides were similar, and are not shown.",
            "cite_spans": [
                {
                    "start": 265,
                    "end": 267,
                    "mention": "34",
                    "ref_id": "BIBREF27"
                }
            ],
            "section": "ETM backbone orientation ::: RESULTS",
            "ref_spans": [
                {
                    "start": 434,
                    "end": 442,
                    "mention": "Fig. 3 B",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 461,
                    "end": 469,
                    "mention": "Fig. 3 C",
                    "ref_id": "FIGREF2"
                }
            ]
        },
        {
            "text": "The dichroic ratios obtained from each measurement, Rhelix and Rsite are shown in Table 1. With each pair of values (Rhelix, Rsite), we can visualize the allowed ω- and β-values for that particular site, as shown in the “smile” plots in Fig. 4, D–K (see Experimental Procedures). The “smiles” for different residues were found to intersect (i.e., converged to a solution) for the pairs 17/18 (Δω = 100°), 18/19 (Δω = 100°), 19/21 (Δω = 200°), 21/22 (Δω = 100°), 22/23 (Δω = 100°), 23/24 (Δω = 100°) and 27/28 (Δω = 100°). More importantly, Table 2 shows that using these Δω, expected for a canonical α-helix, the ω-values are consistent with the pentamer B oligomer obtained previously using global search molecular dynamics (12), except for ω27 and ω28, which are closer to pentamer A than to pentamer B. The Δω between 24 and 27 is therefore 390° (Fig. 4 J), not 300°. Indeed, when we combined 24 and 27 assuming Δω = 300° (not shown) ω24 was 40°, which is not consistent with the value ω24 = −70°, obtained with the pair 23/24. The reason for the inconsistency may be a slight bend from residues 24 to 27, and exemplifies the need to use consecutive residues in these calculations. Slices through a pentamer in agreement with these observations are represented (Fig. 4, L–Q).",
            "cite_spans": [
                {
                    "start": 726,
                    "end": 728,
                    "mention": "12",
                    "ref_id": "BIBREF3"
                }
            ],
            "section": "ETM backbone orientation ::: RESULTS",
            "ref_spans": [
                {
                    "start": 237,
                    "end": 248,
                    "mention": "Fig. 4, D–K",
                    "ref_id": "FIGREF3"
                },
                {
                    "start": 850,
                    "end": 858,
                    "mention": "Fig. 4 J",
                    "ref_id": "FIGREF3"
                },
                {
                    "start": 1265,
                    "end": 1276,
                    "mention": "Fig. 4, L–Q",
                    "ref_id": "FIGREF3"
                },
                {
                    "start": 82,
                    "end": 89,
                    "mention": "Table 1",
                    "ref_id": "TABREF0"
                },
                {
                    "start": 540,
                    "end": 547,
                    "mention": "Table 2",
                    "ref_id": "TABREF1"
                }
            ]
        },
        {
            "text": "We point out that a solution was found consistent with the expected helix periodicity and rotational orientation of pentamer B (see Table 2) when using the pairs 18/19 or 19/21, even with the mutated peptide N15A (isotopically labeled at L19). This suggests that this mutation not only does not perturb the oligomeric forms present in SDS (see Fig. 2) but also does not alter significantly the structure of the oligomer in lipid bilayers. Similarly, our results show that the substitution F23A did not affect the orientation of the α-helices: when the dichroic data from the label introduced at position A23 (Fig. 1 B, asterisks) was combined with V24 or A22, a solution was found which was consistent with the ω-values expected for the pentameric B model. Together with the electrophoresis results, which show that none of the oligomeric forms are affected by mutation F23A (Fig. 2), this suggests that F23 does not play any essential role in either maintaining the oligomeric structure or in defining a particular topology.",
            "cite_spans": [],
            "section": "ETM backbone orientation ::: RESULTS",
            "ref_spans": [
                {
                    "start": 344,
                    "end": 350,
                    "mention": "Fig. 2",
                    "ref_id": "FIGREF1"
                },
                {
                    "start": 609,
                    "end": 617,
                    "mention": "Fig. 1 B",
                    "ref_id": "FIGREF0"
                },
                {
                    "start": 876,
                    "end": 882,
                    "mention": "Fig. 2",
                    "ref_id": "FIGREF1"
                },
                {
                    "start": 132,
                    "end": 139,
                    "mention": "Table 2",
                    "ref_id": "TABREF1"
                }
            ]
        },
        {
            "text": "If the topology of ETM is a regular TMH, the side chains of the 3 Phe residues (F20, F23, and F26) must be at or near the center of the lipid bilayer. To confirm this topology, we labeled ETM with Phe-CN, a nitrile derivatized phenylalanine, at these three positions (see Fig. 1 B, solid dots). The rationale for this experiment is provided by the sensitivity of the C≡N stretching vibration of this nitrile derivatized side chain to the hydration and polarity of the environment (35,36). If the side chain is fully hydrated, the band is centered at 2235 cm−1 in contrast, when inserted deep in phospholipid bilayers, this band shifts to lower wavenumbers, at 2229 cm−1, and becomes narrower (35). Fig. 5 shows the C≡N stretching vibration of the three nitrile derivatized amino acids when ETM is reconstituted in DMPC lipid bilayers. Clearly, for all three Phe residues, the band is centered at ∼2230 cm−1. This indicates a generally hydrophobic and dehydrated environment, consistent with these Phe residues being deeply buried in the lipid bilayer.",
            "cite_spans": [
                {
                    "start": 481,
                    "end": 483,
                    "mention": "35",
                    "ref_id": "BIBREF28"
                },
                {
                    "start": 484,
                    "end": 486,
                    "mention": "36",
                    "ref_id": "BIBREF29"
                },
                {
                    "start": 693,
                    "end": 695,
                    "mention": "35",
                    "ref_id": "BIBREF28"
                }
            ],
            "section": "Phe-CN labeling ::: RESULTS",
            "ref_spans": [
                {
                    "start": 272,
                    "end": 280,
                    "mention": "Fig. 1 B",
                    "ref_id": "FIGREF0"
                },
                {
                    "start": 698,
                    "end": 704,
                    "mention": "Fig. 5",
                    "ref_id": "FIGREF4"
                }
            ]
        },
        {
            "text": "To add support to a pentameric form of SARS-CoV E in biological membranes, we expressed the full length of protein E (shown in Fig. 1 A) in E. coli cells (see Experimental Procedures). After electrophoresis of the extract in reducing conditions, where disulfide covalent bonds are not possible, mainly monomers (∼9 kDa) and pentamers (∼46 kDa) were detected (Fig. 6, lane 2), and also some dimers (∼17 kDa). This suggests that not only protein E pentameric oligomerization may be present in vivo, but also that is mediated, at least partly, by TM interactions.",
            "cite_spans": [],
            "section": "Homopentamers detected after E expression in E. coli cells ::: RESULTS",
            "ref_spans": [
                {
                    "start": 127,
                    "end": 135,
                    "mention": "Fig. 1 A",
                    "ref_id": "FIGREF0"
                },
                {
                    "start": 359,
                    "end": 365,
                    "mention": "Fig. 6",
                    "ref_id": "FIGREF5"
                }
            ]
        },
        {
            "text": "We have shown that SDS-resistant oligomers of ETM, consistent with dimers, trimers, and pentamers, can be observed when ETM is synthesized with two flanking lysine residues. This modification, which we also used in a previous report (12) was made to improve solubility and purification (37). It has been demonstrated (38,39) for various TM oligomers, e.g., monomeric epidermal growth factor receptor (EGFR), dimeric glycophorin A (GpA), and tetrameric M2 from Influenza A, that even with up to four flanking lysines at each C- and N-termini, oligomerization is not affected during SDS PAGE electrophoresis. Also, electrophoretic mobility has been reported to be reduced ∼30% when three lysines are added at each terminus (38). In this work, with only two lysines on each side, the error in molecular weight estimation should not be higher than 20%. In support that a pentameric form of whole E protein is also present in SDS, we show bands consistent with pentamers (∼46 kDa), along with monomers (∼9 kDa) and some dimers (∼17 kDa) of E protein when expressed in E. coli in reducing conditions. In a previous work (8) only monomers (∼9 kDa), dimers (∼18 kDa), and trimers (∼27 kDa) were observed, but only under nonreducing conditions. We are unable to explain these variations in the oligomeric species observed, but they may be related to the complex functionality of SARS- CoV E. In any case, the band at (∼46 kDa) cannot be interpreted as being trimers, because these were observed previously at ∼27 kDa (8). Incidentally, a pentameric homooligomer has also been observed in other similarly sized viral membrane proteins, e.g., the small (63 residues) hydrophobic protein in the respiratory syncytial virus (40,41). It is possible therefore that these two proteins perform similar functions. In this respect, E protein has been found to induce in vivo permeabilization of biological membranes to bulky molecules such as o-nitrophenyl-β-D-galactopyranoside and hygromycin B (8). Although a pentameric porelike structure cannot explain permeabilization to these big molecules, it can explain the permeability to cations observed in an in vitro system (9).",
            "cite_spans": [
                {
                    "start": 234,
                    "end": 236,
                    "mention": "12",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 287,
                    "end": 289,
                    "mention": "37",
                    "ref_id": "BIBREF30"
                },
                {
                    "start": 318,
                    "end": 320,
                    "mention": "38",
                    "ref_id": "BIBREF31"
                },
                {
                    "start": 321,
                    "end": 323,
                    "mention": "39",
                    "ref_id": "BIBREF32"
                },
                {
                    "start": 722,
                    "end": 724,
                    "mention": "38",
                    "ref_id": "BIBREF31"
                },
                {
                    "start": 1115,
                    "end": 1116,
                    "mention": "8",
                    "ref_id": "BIBREF43"
                },
                {
                    "start": 1509,
                    "end": 1510,
                    "mention": "8",
                    "ref_id": "BIBREF43"
                },
                {
                    "start": 1712,
                    "end": 1714,
                    "mention": "40",
                    "ref_id": "BIBREF34"
                },
                {
                    "start": 1715,
                    "end": 1717,
                    "mention": "41",
                    "ref_id": "BIBREF35"
                },
                {
                    "start": 1978,
                    "end": 1979,
                    "mention": "8",
                    "ref_id": "BIBREF43"
                },
                {
                    "start": 2154,
                    "end": 2155,
                    "mention": "9",
                    "ref_id": "BIBREF44"
                }
            ],
            "section": "DISCUSSION",
            "ref_spans": []
        },
        {
            "text": "If model B were correct, the narrowest constriction site along the lumen occurs at F26 (see Fig. 7), with a diameter of only 1.66 Å (the effective diameter of a water molecule is ∼2 Å). Clearly, the model pentamer B is not consistent with an open channel (the diameter of naked Na+ or Ca2+ is ∼2 Å, and that of K+ is even larger, 2.66 Å). We note that similar constriction diameters have been found for other channels in a closed state, e.g., 1 Å in KirBac (42), a bacterial homolog of mammalian inward rectifier K channels. Considering the model A orientation from residues 24–27 however, the channel appears more open. Our experimental data can only be explained by a bend of the α-helices around residues 25–27, with residues 17–24 consistent with pentamer B and 24 onward consistent with pentamer A. The only partial consistency with the computational models may be explained by the fact that during the simulations of ETM (12) we restrained the helix tilt to a particular value, and effects such as bends or kinks, if existed in the native structure, were not accounted for. The result of this simplistic assumption may have been that, instead of a single pentameric model, two different models were obtained with only a partially correct orientation in different parts of the sequence. This conclusion is supported by the fact that none of these two models contained all the lowest energy structures for the 17 sequences analyzed, although most of them (16) were in agreement with model A and only 1 (PHEV) with model B.",
            "cite_spans": [
                {
                    "start": 458,
                    "end": 460,
                    "mention": "42",
                    "ref_id": "BIBREF36"
                },
                {
                    "start": 928,
                    "end": 930,
                    "mention": "12",
                    "ref_id": "BIBREF3"
                },
                {
                    "start": 1460,
                    "end": 1462,
                    "mention": "16",
                    "ref_id": "BIBREF7"
                }
            ],
            "section": "DISCUSSION",
            "ref_spans": [
                {
                    "start": 92,
                    "end": 98,
                    "mention": "Fig. 7",
                    "ref_id": "FIGREF6"
                }
            ]
        },
        {
            "text": "We have estimated the ion conductance of this putative channel, using the pore radius profile (30). The result, 74 pS, is remarkably similar to that reported experimentally (80 pS) using a synthetic polypeptide of SARS-CoV E (9). This value is also similar to the 50–70 pS predicted for phospholamban (43), also suggested to be a cation channel, for which conductance was experimentally reported to be 100 pS (44).",
            "cite_spans": [
                {
                    "start": 95,
                    "end": 97,
                    "mention": "30",
                    "ref_id": "BIBREF23"
                },
                {
                    "start": 226,
                    "end": 227,
                    "mention": "9",
                    "ref_id": "BIBREF44"
                },
                {
                    "start": 302,
                    "end": 304,
                    "mention": "43",
                    "ref_id": "BIBREF37"
                },
                {
                    "start": 410,
                    "end": 412,
                    "mention": "44",
                    "ref_id": "BIBREF38"
                }
            ],
            "section": "DISCUSSION",
            "ref_spans": []
        },
        {
            "text": "We note that our results are in general inconsistent with previous reports (23,45) that suggest that ETM forms a membrane-destabilizing, totally embedded, α-helical transmembrane hairpin. Indeed, we show by DLS that ETM has no disturbing effect on lipid bilayers, and does not induce tubular morphologies.",
            "cite_spans": [
                {
                    "start": 76,
                    "end": 78,
                    "mention": "23",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 79,
                    "end": 81,
                    "mention": "45",
                    "ref_id": "BIBREF39"
                }
            ],
            "section": "DISCUSSION",
            "ref_spans": []
        },
        {
            "text": "Further, we show by H/D exchange that only 25–26 residues are inserted in the membrane, and this is inconsistent with a totally embedded ETM, expected for a hairpin model (23,45).",
            "cite_spans": [
                {
                    "start": 172,
                    "end": 174,
                    "mention": "23",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 175,
                    "end": 177,
                    "mention": "45",
                    "ref_id": "BIBREF39"
                }
            ],
            "section": "DISCUSSION",
            "ref_spans": []
        },
        {
            "text": "Also, the hairpin model predicts that F23 side chain will be at the tip of the hairpin, and located at, or near, the polar headgroups of the lipids (23,45). Our result after labeling the F residues of ETM with cyanophenylalanine favor a TM α-helical topology of ETM, because the frequency of vibration in all F residues is similar and centered around 2230 cm−1, and not closer to 2235 cm−1, which would be expected for a more polar environment.",
            "cite_spans": [
                {
                    "start": 149,
                    "end": 151,
                    "mention": "23",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 152,
                    "end": 154,
                    "mention": "45",
                    "ref_id": "BIBREF39"
                }
            ],
            "section": "DISCUSSION",
            "ref_spans": []
        },
        {
            "text": "Our dichroic data is also consistent with a regular TM α-helix, i.e., the solution to the system of equations (see Experimental Procedures) (16) for the pairs around F23, i.e., 22/23, or 23/24, converges to a sensible result when assuming α-helical canonical periodicity between consecutive residues (Δω = 100°). Equally for the pair 22/24, if Δω ∼ 200°. We also note that if the helix tilt determined previously without any isotopic label (23) was ≤6°, we should be unable to calculate ω-angles for the different residues, because the transition dipole moment of any peptidic C=O bond would have a similar orientation relative to the z axis. In other words, SSID can only provide orientational information if the tilt is at least 10°. In this work, the helix tilt found is in the range 20–30°. We conclude therefore that the topology of ETM in our preparation is not the same as the preparation used to report a TM hairpin (23,45).",
            "cite_spans": [
                {
                    "start": 141,
                    "end": 143,
                    "mention": "16",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 441,
                    "end": 443,
                    "mention": "23",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 925,
                    "end": 927,
                    "mention": "23",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 928,
                    "end": 930,
                    "mention": "45",
                    "ref_id": "BIBREF39"
                }
            ],
            "section": "DISCUSSION",
            "ref_spans": []
        },
        {
            "text": "One possible explanation for the discrepancy may be found in the fact that our peptide contains 2 lysines flanking ETM at both N- and C-termini, whereas these lysines were not present in the latter reports. It is possible that the presence of these positively charged lysines favors a transmembrane topology, and not a hairpin. In any case, the pentameric form we report is unlikely to be an artifact, because these TM interactions and oligomeric size are consistent with evolutionary conservation data and expression of the complete SARS-CoV E polypeptide, and also consistent with the reported ion channel activity. Clearly, more than one topology is possible for ETM, especially considering the range of attributed roles for this small protein.",
            "cite_spans": [],
            "section": "DISCUSSION",
            "ref_spans": []
        },
        {
            "text": "Finally, although channel-like activity appears to be more compatible with a regular α-helix than with a short transmembrane hairpin, the latter may explain better the role of E protein in viral morphogenesis. However, we note that a palindromic sequence similar to the one described for E protein, and which has been suggested to be essential, is only present in the SARS sequence, but not in the rest of the homologs we have considered (12), which should presumably have a similar function.",
            "cite_spans": [
                {
                    "start": 439,
                    "end": 441,
                    "mention": "12",
                    "ref_id": "BIBREF3"
                }
            ],
            "section": "DISCUSSION",
            "ref_spans": []
        },
        {
            "text": "We have obtained experimental data that shows that ETM, flanked with two lysine residues, incorporated in model lipid bilayers adopts an α-helical conformation, with a transmembrane topology, i.e., C- and N-termini in opposite sides of the lipid bilayer. By comparison with previous computational studies, our orientational data of synthetic ETM labeled isotopically is only consistent with a homopentameric model. This pentameric form could be responsible for the ion channel effects observed in vitro in the full length polypeptide of protein E.",
            "cite_spans": [],
            "section": "CONCLUSION",
            "ref_spans": []
        }
    ],
    "ref_entries": {
        "TABREF0": {
            "text": "TABLE 1: Dichroic ratios\n",
            "type": "table"
        },
        "TABREF1": {
            "text": "TABLE 2: Experimental versus predicted orientational values for ETM incorporated in model lipid bilayers\n",
            "type": "table"
        },
        "FIGREF0": {
            "text": "FIGURE 1: (A) Position of the putative TMH domain (TM, see box) in the complete sequence of SARS-CoV E. The residue numbers and N- and C-termini are indicated. (B) Peptides synthesized corresponding to ETM, labeled at various positions with 13C=18O (○) and cyano-phenylalanine (•); two mutated sequences are indicated with a star (right), and the mutated residues are underlined. (C) Synthetic peptides used as a control, corresponding to the TMH domain of CD3-ζ, (top), integrin β2 (middle), and integrin αM (bottom). (D) Schematic representation of an α-helix with parameters ω (range 0–359°) and β (range (0–90°). The peptidic C=O bonds isotopically labeled are shown as spheres (C, solid; O, open). The arrows indicate the direction of the C=O bond relative to the z axis. This direction is obtained from the helix and label dichroic ratios (see Experimental Procedures) and is used to determine ω.",
            "type": "figure"
        },
        "FIGREF1": {
            "text": "FIGURE 2: SDS-PAGE electrophoresis corresponding to the synthetic TM peptide of SARS protein E. Lane 1 shows the molecular weight markers. Lanes 2–4: peptide containing mutation N15A (see Fig. 1 B) with increasing load of peptide: 10, 20, and 40 μg, respectively. Arrows indicate the bands corresponding to the dimer, trimer, and pentameric forms of the peptide. The bands corresponding to the pentamer in lanes 2 and 3 were visible only after silver staining. Electrophoresis results for the other peptides shown in Fig. 1 B were identical, and are not shown.",
            "type": "figure"
        },
        "FIGREF2": {
            "text": "FIGURE 3: Infrared spectra of ETM incorporated in DMPC lipid bilayers. (A) Nonpolarized infrared spectra of the amide I and II region in H2O, either at low hydration (solid line) or hydrated in D2O (dashed line). The small reduction in amide II intensity is due to H/D exchange. (B) Amide I region and isotopic 13C=18O label (residue A22), centered at 1590 cm−1 (see inset), obtained at 0° (solid line) or 90° (dashed line) polarization. (C) Same as in B, but corresponding to the amide A of the spectrum.",
            "type": "figure"
        },
        "FIGREF3": {
            "text": "FIGURE 4: Visualization of the dichroic data obtained and proposed model for the ETM pentamer: (A) plot corresponding to the order parameter, f, of a labeled residue as a function of ω and β, assuming a Rsite of 4.2; (B) the same plot for Rhelix, when Rhelix is 3.5; (C) superposition of the two surfaces in A and B, where the intersection corresponds to (ω,β) coordinates with the same disorder f ; (D–K) coordinates (ω,β) at the intersection shown in C for pairs V17/L18 (D), L18/L19 (E), L19/L21 (F), L21/A22 (G), A22/A23 (H), A23/V24 (I), V24/L27 (J), and L27/L28 (K); (L–Q), slices for the model in agreement with our dichroic data: 11–13 (L), 14–18 (M), 19–22 (N), 23–26 (O), 27–30 (P) and 31–34 (Q). The residue numbers are indicated. Color code: L, green; V, cyan; I, salmon; A, marine; F, blue; N, orange; and S and T, red.",
            "type": "figure"
        },
        "FIGREF4": {
            "text": "FIGURE 5: Spectral features of the C≡N stretching vibration for F20 (dotted line), F23 (dashed line), and F26 (solid line) cyano-phenylalanine when ETM was reconstituted in DMPC lipid bilayers.",
            "type": "figure"
        },
        "FIGREF5": {
            "text": "FIGURE 6: Expression and oligomerization of SARS-CoV E protein. The His-tagged E protein expressed in E. Coli BL21DE3pLysS cells was analyzed for expression as uninduced and induced total cell lysate fractions (lanes 1 and 2), respectively, on a 15% SDS polyacrylamide gels in the presence of 150 mM DTT and 2% SDS. The proteins were transferred to a nitrocellulose membrane and probed with polyclonal anti His tag antibody in 1:1000 dilution. This was by followed incubating with horse radish-peroxidase conjugated anti rabbit IgG and the E protein was detected by a chemiluminescence detection kit. Numbers on the right indicate molecular masses (kDa).",
            "type": "figure"
        },
        "FIGREF6": {
            "text": "FIGURE 7: Plot showing the pore radius for the model pentamer B (solid line) and A (dashed line) as a function of the z coordinate (normal to the bilayer). As the orientation of residues 27 and 28 are more similar to pentamer A; we also show the plot as a hybrid between pentamer A and B, as a thicker line.",
            "type": "figure"
        }
    },
    "back_matter": [],
    "bib_entries": {
        "BIBREF0": {
            "title": "",
            "authors": [],
            "year": 2003,
            "venue": "Science.",
            "volume": "300",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF1": {
            "title": "",
            "authors": [],
            "year": 2001,
            "venue": "Protein Sci.",
            "volume": "10",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF2": {
            "title": "",
            "authors": [],
            "year": 1995,
            "venue": "Nat. Struct. Biol.",
            "volume": "2",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF3": {
            "title": "",
            "authors": [],
            "year": 2005,
            "venue": "Biophys. J.",
            "volume": "88",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF4": {
            "title": "",
            "authors": [],
            "year": 2001,
            "venue": "Proteins.",
            "volume": "44",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF5": {
            "title": "",
            "authors": [],
            "year": 2000,
            "venue": "J. Mol. Biol.",
            "volume": "300",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF6": {
            "title": "",
            "authors": [],
            "year": 2002,
            "venue": "J. Mol. Biol.",
            "volume": "316",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF7": {
            "title": "",
            "authors": [],
            "year": 1997,
            "venue": "J. Am. Chem. Soc.",
            "volume": "119",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF8": {
            "title": "",
            "authors": [],
            "year": 1999,
            "venue": "J. Mol. Biol.",
            "volume": "286",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF9": {
            "title": "",
            "authors": [],
            "year": 2000,
            "venue": "Biophys. J.",
            "volume": "78",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF10": {
            "title": "",
            "authors": [],
            "year": 1999,
            "venue": "Biophys. J.",
            "volume": "77",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF11": {
            "title": "",
            "authors": [],
            "year": 1998,
            "venue": "J. Virol.",
            "volume": "72",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF12": {
            "title": "",
            "authors": [],
            "year": 2000,
            "venue": "J. Biol. Chem.",
            "volume": "275",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF13": {
            "title": "",
            "authors": [],
            "year": 2001,
            "venue": "Biopolymers.",
            "volume": "59",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF14": {
            "title": "",
            "authors": [],
            "year": 1997,
            "venue": "Methods Enzymol.",
            "volume": "289",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF15": {
            "title": "",
            "authors": [],
            "year": 2004,
            "venue": "J. Mol. Biol.",
            "volume": "341",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF16": {
            "title": "",
            "authors": [],
            "year": 1986,
            "venue": "Biochim. Biophys. Acta.",
            "volume": "858",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF17": {
            "title": "",
            "authors": [],
            "year": 2002,
            "venue": "Mol. Microbiol.",
            "volume": "44",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF18": {
            "title": "",
            "authors": [],
            "year": 1999,
            "venue": "Biophys. J.",
            "volume": "77",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF19": {
            "title": "",
            "authors": [],
            "year": 1962,
            "venue": "J. Polym. Sci. [B].",
            "volume": "59",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF20": {
            "title": "",
            "authors": [],
            "year": 2000,
            "venue": "Biophys. J.",
            "volume": "78",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF21": {
            "title": "",
            "authors": [],
            "year": 2003,
            "venue": "",
            "volume": "",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF22": {
            "title": "",
            "authors": [],
            "year": 2001,
            "venue": "J. Biol. Chem.",
            "volume": "276",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF23": {
            "title": "",
            "authors": [],
            "year": 1996,
            "venue": "J Mol. Graph.",
            "volume": "14",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF24": {
            "title": "",
            "authors": [],
            "year": 2001,
            "venue": "Proc. Natl. Acad. Sci. USA.",
            "volume": "98",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF25": {
            "title": "",
            "authors": [],
            "year": 2000,
            "venue": "Nat. Struct. Biol.",
            "volume": "7",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF26": {
            "title": "",
            "authors": [],
            "year": 1986,
            "venue": "Biopolymers.",
            "volume": "25",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF27": {
            "title": "",
            "authors": [],
            "year": 2002,
            "venue": "J. Mol. Biol.",
            "volume": "316",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF28": {
            "title": "",
            "authors": [],
            "year": 2003,
            "venue": "J. Am. Chem. Soc.",
            "volume": "125",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF29": {
            "title": "",
            "authors": [],
            "year": 2004,
            "venue": "J. Am. Chem. Soc.",
            "volume": "126",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF30": {
            "title": "",
            "authors": [],
            "year": 2002,
            "venue": "J. Mol. Biol.",
            "volume": "322",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF31": {
            "title": "",
            "authors": [],
            "year": 2001,
            "venue": "Biochemistry.",
            "volume": "40",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF32": {
            "title": "",
            "authors": [],
            "year": 2003,
            "venue": "Biopolymers.",
            "volume": "71",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF33": {
            "title": "",
            "authors": [],
            "year": 1996,
            "venue": "Virology.",
            "volume": "218",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF34": {
            "title": "",
            "authors": [],
            "year": 1993,
            "venue": "J. Gen. Virol.",
            "volume": "74",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF35": {
            "title": "",
            "authors": [],
            "year": 2003,
            "venue": "Protein Sci.",
            "volume": "12",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF36": {
            "title": "",
            "authors": [],
            "year": 2003,
            "venue": "Science.",
            "volume": "300",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF37": {
            "title": "",
            "authors": [],
            "year": 1997,
            "venue": "Biophys. Chem.",
            "volume": "69",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF38": {
            "title": "",
            "authors": [],
            "year": 1988,
            "venue": "J. Biol. Chem.",
            "volume": "263",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF39": {
            "title": "",
            "authors": [],
            "year": 2006,
            "venue": "Biophys. J.",
            "volume": "90",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF40": {
            "title": "",
            "authors": [],
            "year": 2000,
            "venue": "J. Virol.",
            "volume": "74",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF41": {
            "title": "",
            "authors": [],
            "year": 1999,
            "venue": "J. Virol.",
            "volume": "73",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF42": {
            "title": "",
            "authors": [],
            "year": 2001,
            "venue": "Adv. Exp. Med. Biol.",
            "volume": "494",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF43": {
            "title": "",
            "authors": [],
            "year": 2004,
            "venue": "Biochem. Biophys. Res. Commun.",
            "volume": "325",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF44": {
            "title": "",
            "authors": [],
            "year": 2004,
            "venue": "Virology.",
            "volume": "330",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        }
    }
}