{
    "paper_id": "PMC1090624",
    "metadata": {
        "title": "Intracellular localization of Crimean-Congo Hemorrhagic Fever (CCHF) virus glycoproteins",
        "authors": [
            {
                "first": "Sebastian",
                "middle": [],
                "last": "Haferkamp",
                "suffix": "",
                "email": "basti.haferkamp@gmx.de",
                "affiliation": {}
            },
            {
                "first": "Lisa",
                "middle": [],
                "last": "Fernando",
                "suffix": "",
                "email": "Lisa_Fernando@phac-aspc.gc.ca",
                "affiliation": {}
            },
            {
                "first": "Tino",
                "middle": [
                    "F"
                ],
                "last": "Schwarz",
                "suffix": "",
                "email": "t.schwarz@juliusspital.de",
                "affiliation": {}
            },
            {
                "first": "Heinz",
                "middle": [],
                "last": "Feldmann",
                "suffix": "",
                "email": "Heinz_Feldmann@phac-aspc.gc.ca",
                "affiliation": {}
            },
            {
                "first": "Ramon",
                "middle": [],
                "last": "Flick",
                "suffix": "",
                "email": "raflick@utmb.edu",
                "affiliation": {}
            }
        ]
    },
    "body_text": [
        {
            "text": "Crimean-Congo hemorrhagic fever virus (CCHFV) is a member of the genus Nairovirus, one of five genera in the family Bunyaviridae [1]. Bunyaviruses are enveloped particles with a tripartite, single stranded RNA genome of negative polarity [2-4]. The three genome segments encode four structural proteins: the RNA-dependent RNA polymerase (L protein) is encoded by the large (L) segment, the glycoproteins (GN and GC; previously referred to as G1 and G2) are encoded by the medium (M) segment, and the nucleocapsid protein (N) is encoded by the small (S) segment [2-4].",
            "cite_spans": [
                {
                    "start": 130,
                    "end": 131,
                    "mention": "1",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 239,
                    "end": 240,
                    "mention": "2",
                    "ref_id": "BIBREF11"
                },
                {
                    "start": 241,
                    "end": 242,
                    "mention": "4",
                    "ref_id": "BIBREF33"
                },
                {
                    "start": 562,
                    "end": 563,
                    "mention": "2",
                    "ref_id": "BIBREF11"
                },
                {
                    "start": 564,
                    "end": 565,
                    "mention": "4",
                    "ref_id": "BIBREF33"
                }
            ],
            "section": "Background",
            "ref_spans": []
        },
        {
            "text": "The virus glycoproteins are likely to play an important role in the natural tick-vertebrate cycle of the virus as well as for the high pathogenicity in humans. Indeed, a highly variable mucin-like region at the amino terminus of the CCHFV glycoprotein precursor has recently been identified, a unique feature of nairoviruses within the family Bunyaviridae [5]. A similar serine-threonine-rich domain has been associated with increased vascular permeability and development of hemorrhages in Ebola hemorrhagic fever [6].",
            "cite_spans": [
                {
                    "start": 357,
                    "end": 358,
                    "mention": "5",
                    "ref_id": "BIBREF44"
                },
                {
                    "start": 516,
                    "end": 517,
                    "mention": "6",
                    "ref_id": "BIBREF47"
                }
            ],
            "section": "Background",
            "ref_spans": []
        },
        {
            "text": "The Nairovirus genus includes 34 described viruses and is divided into seven different serogroups [1]. Only three viruses are known to cause disease: CCHFV, Dugbe virus, and Nairobi sheep disease virus. CCHFV is an arthropod-borne pathogen and the causative agent of a serious form of hemorrhagic fever [7-9] with mortality rates ranging from 15 to 60% [10-17]. The virus is endemic in parts of Africa, Southeastern Europe and Asia as far east as western China [16,18,19]. The geographic distribution of CCHFV infections corresponds most closely with the distribution of Hyalomma ticks, suggesting their principal vector role [18,20,21]. Hyalomma ticks normally feed on a variety of livestock (sheep, goats, cattle, and ostriches), large wild herbivores, hares, and hedgehogs, which can become infected with CCHFV [13,18,22,23]. In contrast to human infections, infection in these animals generally results in inapparent or subclinical disease but generates viremia levels capable of supporting virus transmission to uninfected ticks [10,18,21,23-25]. Transmission to humans occurs either by bites from infected ticks or direct contact with blood or tissues of infected livestock. Nosocomial infections are common [26] and represent a major problem in health care institutions [27].",
            "cite_spans": [
                {
                    "start": 99,
                    "end": 100,
                    "mention": "1",
                    "ref_id": "BIBREF0"
                },
                {
                    "start": 304,
                    "end": 305,
                    "mention": "7",
                    "ref_id": "BIBREF48"
                },
                {
                    "start": 306,
                    "end": 307,
                    "mention": "9",
                    "ref_id": "BIBREF50"
                },
                {
                    "start": 354,
                    "end": 356,
                    "mention": "10",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 357,
                    "end": 359,
                    "mention": "17",
                    "ref_id": "BIBREF8"
                },
                {
                    "start": 462,
                    "end": 464,
                    "mention": "16",
                    "ref_id": "BIBREF7"
                },
                {
                    "start": 465,
                    "end": 467,
                    "mention": "18",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 468,
                    "end": 470,
                    "mention": "19",
                    "ref_id": "BIBREF10"
                },
                {
                    "start": 627,
                    "end": 629,
                    "mention": "18",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 630,
                    "end": 632,
                    "mention": "20",
                    "ref_id": "BIBREF12"
                },
                {
                    "start": 633,
                    "end": 635,
                    "mention": "21",
                    "ref_id": "BIBREF13"
                },
                {
                    "start": 815,
                    "end": 817,
                    "mention": "13",
                    "ref_id": "BIBREF4"
                },
                {
                    "start": 818,
                    "end": 820,
                    "mention": "18",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 821,
                    "end": 823,
                    "mention": "22",
                    "ref_id": "BIBREF14"
                },
                {
                    "start": 824,
                    "end": 826,
                    "mention": "23",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 1035,
                    "end": 1037,
                    "mention": "10",
                    "ref_id": "BIBREF1"
                },
                {
                    "start": 1038,
                    "end": 1040,
                    "mention": "18",
                    "ref_id": "BIBREF9"
                },
                {
                    "start": 1041,
                    "end": 1043,
                    "mention": "21",
                    "ref_id": "BIBREF13"
                },
                {
                    "start": 1044,
                    "end": 1046,
                    "mention": "23",
                    "ref_id": "BIBREF15"
                },
                {
                    "start": 1047,
                    "end": 1049,
                    "mention": "25",
                    "ref_id": "BIBREF17"
                },
                {
                    "start": 1215,
                    "end": 1217,
                    "mention": "26",
                    "ref_id": "BIBREF18"
                },
                {
                    "start": 1278,
                    "end": 1280,
                    "mention": "27",
                    "ref_id": "BIBREF19"
                }
            ],
            "section": "Background",
            "ref_spans": []
        },
        {
            "text": "The widespread geographical distribution of CCHFV, its ability to produce severe human disease with high mortality rates, and fears about its intentional use as a bioterrorism agent  makes CCHFV an extremely important human pathogen and a worldwide public health concern. Case management and intervention strategies would greatly benefit from knowledge of the biology and pathogenesis of the virus.",
            "cite_spans": [],
            "section": "Background",
            "ref_spans": []
        },
        {
            "text": "Recently, the expression strategy and biosynthesis of the CCHFV glycoproteins have been studied in more detail including the identification of precursor cleavage sites and the determination of the exact N termini of the two major cleavage products, GN and GC [5,28]. SKI-1, also responsible for the proteolytic processing of the Lassa virus glycoprotein precursor [29], has been identified as the cellular protease responsible for the processing step that generates the N-terminus of mature GN. Another yet unidentified protease is required for GC processing. However, the exact C-terminus of GN could not yet been determined. Two cleavage sites have been predicted for this processing step, one at amino acid position 808 (RKLL) and the other at 940/944 (KKRKK) favouring the cellular proteases SKI-1 and furin, respectively, as the responsible proteases [28].",
            "cite_spans": [
                {
                    "start": 260,
                    "end": 261,
                    "mention": "5",
                    "ref_id": "BIBREF44"
                },
                {
                    "start": 262,
                    "end": 264,
                    "mention": "28",
                    "ref_id": "BIBREF20"
                },
                {
                    "start": 365,
                    "end": 367,
                    "mention": "29",
                    "ref_id": "BIBREF21"
                },
                {
                    "start": 857,
                    "end": 859,
                    "mention": "28",
                    "ref_id": "BIBREF20"
                }
            ],
            "section": "Background",
            "ref_spans": []
        },
        {
            "text": "Bunyaviruses are known to bud from Golgi membranes and the budding site seems to be defined by an retention of the glycoproteins GN and GC at that particular site [3,4]. From a number of studies which have addressed the mechanisms of Golgi targeting and retention, one can conclude that the N-terminal located glycoprotein appears to carry the appropriate signal(s) [30-40] So far, no studies have investigated Golgi targeting and retention of nairovirus glycoproteins.",
            "cite_spans": [
                {
                    "start": 164,
                    "end": 165,
                    "mention": "3",
                    "ref_id": "BIBREF22"
                },
                {
                    "start": 166,
                    "end": 167,
                    "mention": "4",
                    "ref_id": "BIBREF33"
                },
                {
                    "start": 367,
                    "end": 369,
                    "mention": "30",
                    "ref_id": "BIBREF23"
                },
                {
                    "start": 370,
                    "end": 372,
                    "mention": "40",
                    "ref_id": "BIBREF34"
                }
            ],
            "section": "Background",
            "ref_spans": []
        },
        {
            "text": "In this study we cloned the complete M segment ORF of CCHFV, strain IbAr10200, into different expression plasmids. Expression and intracellular localization of the glycoproteins GN and GC were studied and compared to glycoproteins generated by virus infection. Using recombinant fusion proteins between the green fluorescence protein (GFP) and CCHFV glycoproteins, the Golgi targeting/retention signal could be mapped to a hydrophobic region within the cytoplasmic domain of the GN protein.",
            "cite_spans": [],
            "section": "Background",
            "ref_spans": []
        },
        {
            "text": "The complete M segment nucleotide sequences of two different sources of CCHFV, strain IbAr10200, was determined and compared to previously published sequences [GenBank: U39455]. Several nucleotide changes resulting in amino acid changes in the glycoprotein precursor were identified (Table 1). In two different CCHF viral RNA samples eight amino acid changes and two silent nucleotide changes could be detected. Four additional amino acid changes were found in sample #2 as well as four silent nucleotide changes not leading to any amino acid alteration. CCHFV RNA sample #1 showed two additional unique amino acid changes.",
            "cite_spans": [],
            "section": "Sequence determination of the full-length CCHFV M segment ::: Results",
            "ref_spans": [
                {
                    "start": 290,
                    "end": 291,
                    "mention": "1",
                    "ref_id": "TABREF0"
                }
            ]
        },
        {
            "text": "Furthermore, we determined the sequences of the exact ends of the M segment using an RNA ligation approach. Beside constructs with nucleotide deletions due to RNA degradation prior to RNA ligation several full-length sequences were determined, demonstrating the expected homologous RNA ends compare to the CCHF S and L segments (Fig. 1). Especially the first and last nine nucleotides of the CCHF M vRNA segment showed high complementarity to the L and S segment ends (bold and italicized nucleotides in Fig. 1), confirming their role as important cis-acting elements for RNA polymerase binding [41,42].",
            "cite_spans": [
                {
                    "start": 596,
                    "end": 598,
                    "mention": "41",
                    "ref_id": "BIBREF35"
                },
                {
                    "start": 599,
                    "end": 601,
                    "mention": "42",
                    "ref_id": "BIBREF36"
                }
            ],
            "section": "Sequence determination of the full-length CCHFV M segment ::: Results",
            "ref_spans": [
                {
                    "start": 334,
                    "end": 335,
                    "mention": "1",
                    "ref_id": "FIGREF0"
                },
                {
                    "start": 509,
                    "end": 510,
                    "mention": "1",
                    "ref_id": "FIGREF0"
                }
            ]
        },
        {
            "text": "Based on the recently published N-terminal sequence determination of mature CCHFV glycoproteins [5] and using the above described determined CCHFV M segment sequence (sample #1), expression plasmids for both glycoproteins GN and GC as well as for the glycoprotein precursor (GPC) were generated. Since the C-terminus of CCHFV GN has not yet been determined ([28]; S. Nichol: pers. communication) two constructs were generated containing an N-terminal Influenza HA-tag for detection: pCMV CCHF GN \"short\" (GNs) and pCMV CCHF GN \"long\" (GNl). Glycoprotein expression was first analyzed by immunoblot using CCHFV-specific polyclonal or HA-tag antibodies. The CCHF full-length glycoprotein precursor construct (pCAGGS CCHFV GPC) was successfully expressed and correctly processed into the cleavage fragments GC and GN (Fig. 2, lane 2). Molecular weights (GC, 37 kDa and GN, 75 kDa) as determined by immunoblot analysis were in accordance with those of the GC and GN expressed in CCHFV-infected VeroE6 cells (Fig. 2, lane 1). CMV-driven HA-GNs and HA-GNl expression resulted in a protein of approximately 75 kDa (Fig. 2, lanes 3 and 4), similar to authentic GN glycoprotein seen in CCHFV-infected cells (Fig. 2, lane 1). Expression of chicken β-actin-driven GC resulted in a product of approximately 37 kDa, again similar to GC expression in CCHV-infected cells (Fig. 2, lane 5). The data demonstrates that each glycoprotein can be authentically expressed individually from separate plasmids (e.g., pCMV GNs, pCMV GNl and pCAGGS GC) as well as from a clone encoding the GPC precursor (pCAGGS GPC) using polyclonal CCHFV-specific and HA-tag antibodies (Fig. 2). Expression could also be confirmed using CCHFV-specific GC and GN antipeptide antibodies which were kindly provided by S. Nichol, CDC) (data not shown).",
            "cite_spans": [
                {
                    "start": 97,
                    "end": 98,
                    "mention": "5",
                    "ref_id": "BIBREF44"
                },
                {
                    "start": 359,
                    "end": 361,
                    "mention": "28",
                    "ref_id": "BIBREF20"
                }
            ],
            "section": "Expression of CCHFV glycoproteins ::: Results",
            "ref_spans": [
                {
                    "start": 820,
                    "end": 821,
                    "mention": "2",
                    "ref_id": "FIGREF1"
                },
                {
                    "start": 1009,
                    "end": 1010,
                    "mention": "2",
                    "ref_id": "FIGREF1"
                },
                {
                    "start": 1113,
                    "end": 1114,
                    "mention": "2",
                    "ref_id": "FIGREF1"
                },
                {
                    "start": 1204,
                    "end": 1205,
                    "mention": "2",
                    "ref_id": "FIGREF1"
                },
                {
                    "start": 1363,
                    "end": 1364,
                    "mention": "2",
                    "ref_id": "FIGREF1"
                },
                {
                    "start": 1652,
                    "end": 1653,
                    "mention": "2",
                    "ref_id": "FIGREF1"
                }
            ]
        },
        {
            "text": "Indirect immunofluorescence assays (IFA) were initially performed to analyze the cellular localization of CCHFV glycoproteins. For this, different CCHFV glycoprotein expression plasmids were individually transfected into BHK-21 or 293T cells and 24 to 48 h post transfection the cells were fixed with acetone/methanol or paraformaldehyde for intracellular (Fig. 3A) or surface immunofluorescence analysis (Fig. 3B), respectively. HA-specific monoclonal antibodies were used to detect the two forms of individually expressed N-terminal HA-tagged GN (Fig. 3A: b, c, g, h) and CCHFV GC-specific antibodies were used to monitor β-actin promoter-driven GC expression products (Fig. 3A: a, f). In addition, a CCHFV-specific antiserum was used to detect GN and GC expression from full-length glycoprotein precursor construct pCAGGS GPC (Fig. 3A: d, i) as well as in CCHFV-infected cells (Fig. 3A: e, j). In all cases GN and GC were detected intracellular but never on the cell surface (Figs. 3A and 3B). Mock-infected and -transfected cells were used as negative controls (data not shown). Two different cell lines were used to exclude artificial cell type-specific localization pattern of CCHFV glycoproteins.",
            "cite_spans": [],
            "section": "Intracellular localization of CCHFV glycoproteins ::: Results",
            "ref_spans": [
                {
                    "start": 362,
                    "end": 364,
                    "mention": "3A",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 411,
                    "end": 413,
                    "mention": "3B",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 554,
                    "end": 556,
                    "mention": "3A",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 677,
                    "end": 679,
                    "mention": "3A",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 835,
                    "end": 837,
                    "mention": "3A",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 886,
                    "end": 888,
                    "mention": "3A",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 985,
                    "end": 987,
                    "mention": "3A",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 992,
                    "end": 994,
                    "mention": "3B",
                    "ref_id": "FIGREF2"
                }
            ]
        },
        {
            "text": "In a next step we tried to specify the intracellular localization of CCHFV GN and GC glycoproteins expressed from plasmids encoding either the individual glycoproteins or the precursor GPC. Intracellular staining pattern of CCHV-infected cells as well as cells expressing the CCHFV precursor GPC revealed a Golgi complex staining pattern independent of the antibodies used for detection of the individual glycoproteins (Fig. 3A: d, e, i, j). Subsequently, we analyzed the intracellular localization of individually expressed GN and GC. Whereas individually expressed GN showed a Golgi complex localization (Fig. 3A: b, c, g, h), individually expressed GC accumulated in the perinuclear region of the cell indicative of ER localization (Fig. 3A: a, f). Confirmation for these results were achieved by co-immunofluorescence analyzed on a confocal microscope using CCHFV glycoprotein-specific or HA-specific antibodies and either antibodies directed against the ER-specific marker molecule calreticulin or direct staining of the Golgi region with BODIPY-TR C5 ceramides (Fig. 4). Again, CCHFV GN expression from the two expression plasmids pCMV GNs and pCMV GNl overlapped with Golgi staining (Fig. 4: e, f), whereas GC expression overlapped with that of calreticulin (Fig. 4: d). However, co-expression of both CCHFV glycoproteins either from the glycoprotein precursor plasmid or from simultaneous transfection of the two expression plasmids resulted in Golgi targeting of both glycoproteins (Fig. 4: c, g) strongly indicating that GN drives the Golgi localization and that GC needs to interact with GN in order to be transported out of the ER.",
            "cite_spans": [],
            "section": "Intracellular localization of CCHFV glycoproteins ::: Results",
            "ref_spans": [
                {
                    "start": 425,
                    "end": 427,
                    "mention": "3A",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 612,
                    "end": 614,
                    "mention": "3A",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 741,
                    "end": 743,
                    "mention": "3A",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 1073,
                    "end": 1074,
                    "mention": "4",
                    "ref_id": "FIGREF3"
                },
                {
                    "start": 1196,
                    "end": 1197,
                    "mention": "4",
                    "ref_id": "FIGREF3"
                },
                {
                    "start": 1271,
                    "end": 1272,
                    "mention": "4",
                    "ref_id": "FIGREF3"
                },
                {
                    "start": 1497,
                    "end": 1498,
                    "mention": "4",
                    "ref_id": "FIGREF3"
                }
            ]
        },
        {
            "text": "To further strengthen the association of CCHFV glycoproteins with intracellular membrane-containing compartments such as ER and Golgi complex, we performed subcellular fractionation experiments. This method allows the separation of soluble proteins from membrane-associated proteins. CCHFV-infected cells were used for comparison (Fig. 5: lane 1). As expected all expressed CCHFV glycoproteins were exclusively found in the pellet fractions, which contain membrane-associated proteins. This confirms the intracellular localization of these proteins with membrane structures and together with the co-immunofluorescence data confirms either ER or Golgi localization (Fig. 5: lanes 2 to 5). To evaluate the described approach control experiments using either the soluble CCHFV N proteins or the Golgi marker Mannosidase II were performed. As expected CCHF N protein was exclusively found in the soluble fraction, whereas the Golgi marker protein was only detected in the membrane-associate fraction.",
            "cite_spans": [],
            "section": "Intracellular localization of CCHFV glycoproteins ::: Results",
            "ref_spans": [
                {
                    "start": 336,
                    "end": 337,
                    "mention": "5",
                    "ref_id": "FIGREF4"
                },
                {
                    "start": 670,
                    "end": 671,
                    "mention": "5",
                    "ref_id": "FIGREF4"
                }
            ]
        },
        {
            "text": "After determining the intracellular localization of the CCHFV glycoproteins, we next were interested to determine the signals for intracellular targeting. For this, we generated GFP-fusion proteins containing different fragments of the GC or GN proteins attached to GFP. On the basis of published data obtained with other bunyaviruses we expected Golgi localization signals rather within the transmembrane or cytoplasmic domains than in the ectodomain [3,4]. A CMV-driven GFP expression plasmid (pHL2823, Flick and Hobom, unpublished) was used as a cloning vector for fusing different regions of the CCHFV glycoproteins to the C-terminus of the GFP. Firstly, the different PCR-amplified GN cytoplasmic domain fragments (Table 2) were cleaved with BsmBI and inserted into pHL2823 after BamHI/XbaI endonuclease treatment. In an alternative approach a signal peptide (Ig κ-chain signal of the pDisplay vector) was fused to the GFP N-terminus to allow entry into the secretory pathway. Secondly, the GN transmembrane domain (TM I) was inserted using a hybridized oligonucleotide linker (RF372/RF373: GATCCTTTGGCTATGT AATAACCTGCATACTTTGCAAGGCCATTTTTTACTTGTTAATAATTGTTGGATAAT/ CTAGATTATCCAACAATTATTAACAAGTAAAAAATGGCCTTGCAAAGTATGCAGGTTATTACATAGCCAAAG). The expression of the resulting constructs GFP-GNA, GFP-GNB, GFP-GNC, GFP-GND, GFP-GNE, GFP-GNF, GFP-GNG, GFP-GNH, and GFP-GNI (Fig. 6A) was first verified by immunoblot (data not shown). All constructs expressed GFP-fusion proteins of expected sizes and were subsequently used in co-localization studies. For this two different cell lines (BHK-21 and 293T), for comparison purposes, were transfected with the different plasmid DNAs and GFP fluorescence localization was analyzed using UV-microscopy.",
            "cite_spans": [
                {
                    "start": 453,
                    "end": 454,
                    "mention": "3",
                    "ref_id": "BIBREF22"
                },
                {
                    "start": 455,
                    "end": 456,
                    "mention": "4",
                    "ref_id": "BIBREF33"
                }
            ],
            "section": "Signals for intracellular targeting of CCHFV glycoproteins ::: Results",
            "ref_spans": [
                {
                    "start": 1379,
                    "end": 1381,
                    "mention": "6A",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 726,
                    "end": 727,
                    "mention": "2",
                    "ref_id": "TABREF1"
                }
            ]
        },
        {
            "text": "The fusion protein GFP-GNI, containing the TM I of CCHF GN was expressed in the cell cytoplasm in both used cell lines (Figs. 6B and 6C: b) similarly to GFP expressed from the basic vector pHL2823 (Figs. 6B and 6C: a). In case of the signal peptide-containing GFP fusion protein a diffuse staining consistent with the distribution throughout the secretory system was observed (data not shown). Based on this result we conclude that the transmembrane domain TM I does not contain any intracellular targeting signal.",
            "cite_spans": [],
            "section": "Signals for intracellular targeting of CCHFV glycoproteins ::: Results",
            "ref_spans": [
                {
                    "start": 126,
                    "end": 128,
                    "mention": "6B",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 133,
                    "end": 135,
                    "mention": "6C",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 204,
                    "end": 206,
                    "mention": "6B",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 211,
                    "end": 213,
                    "mention": "6C",
                    "ref_id": "FIGREF5"
                }
            ]
        },
        {
            "text": "The fusion proteins GFP-GNA and GFP-GNB showed a similar cytoplasmic expression pattern (Figs. 6B and 6C: c, d). GFP-GNA contains the first 87 amino acids from the cytoplasmic domain including the RKLL motif at position 808, which is a predicted protease cleavage motif for generating the C-terminus of the mature GN protein, whereas GFP-GNB has 99 amino acids fused to the GFP C-terminus, corresponding to the first GN cytosolic tail fragment, which is followed by a second hydrophobic region predicted as a potential transmembrane domain 2 (TM II) (compare Fig. 6A). Interestingly, the fusion proteins GFP-GNC, GFP-GND, GFP-GNE, GFP-GNF, GFP-GNG, and GFP-GNH, which contain longer fragments of the predicted GN cytoplasmic domain including additional predicted hydrophobic transmembran regions (Fig. 6A), showed an increased level of similarity to the intracellular pattern of GNl, which contained the entire GN cytoplasmic domain up to the determined mature GC start (Figs. 6B and 6C: e-j). The switch from a diffuse staining pattern to a Golgi complex localization is caused by the addition of TM II to the first 99 amino acids of the cytoplasmic domain resulting in GFP-fusion proteins containing 122 amino acids of the predicted GN cytoplasmic domain (Fig. 6A). These results demonstrate that the Golgi targeting signal is not located within the first 99 amino acids of the GN cytoplasmic domain. However, the addition of an additional hydrophobic 23 amino acid stretch (TM II) result in a co-localization of the GFP-fusion protein with the Golgi complex marker mannosidase II (Fig. 7), demonstrating that a Golgi localization signal is located within the predicted TM II.",
            "cite_spans": [],
            "section": "Signals for intracellular targeting of CCHFV glycoproteins ::: Results",
            "ref_spans": [
                {
                    "start": 95,
                    "end": 97,
                    "mention": "6B",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 102,
                    "end": 104,
                    "mention": "6C",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 564,
                    "end": 566,
                    "mention": "6A",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 802,
                    "end": 804,
                    "mention": "6A",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 977,
                    "end": 979,
                    "mention": "6B",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 984,
                    "end": 986,
                    "mention": "6C",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 1263,
                    "end": 1265,
                    "mention": "6A",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 1589,
                    "end": 1590,
                    "mention": "7",
                    "ref_id": "FIGREF6"
                }
            ]
        },
        {
            "text": "The Golgi localization signal was further analyzed with two more GFP-fusion proteins containing only the 23 amino acids from the predicted TM II directly fused to the C-terminus of GFP. To determine if a specific primary sequence within TM II was recognized as a signal or rather the hydrophobic character of this region was crucial to target GFP to the Golgi complex, the 23 amino acids were fused in two different orientations (Fig. 6A). BHK-21 (Fig. 6B) and 293T (Fig. 6C) cells were transfected with these constructs and GFP expression and intracellular localization were analyzed. Both GFP-fusion proteins showed specific Golgi complex localization demonstrating that TM II contains a Golgi localization signal and that the orientation of the primary amino acid sequence is not important for GFP translocation (Figs. 6B and 6C: k, l). GFP fusion proteins containing either the predicted GC TM (GFP GCA) or cytoplasmic domain (GFP GCB) showed perinuclear staining, suggesting ER localization (Figs. 6B and 6C: m, n).",
            "cite_spans": [],
            "section": "Signals for intracellular targeting of CCHFV glycoproteins ::: Results",
            "ref_spans": [
                {
                    "start": 435,
                    "end": 437,
                    "mention": "6A",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 453,
                    "end": 455,
                    "mention": "6B",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 472,
                    "end": 474,
                    "mention": "6C",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 822,
                    "end": 824,
                    "mention": "6B",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 829,
                    "end": 831,
                    "mention": "6C",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 1003,
                    "end": 1005,
                    "mention": "6B",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 1010,
                    "end": 1012,
                    "mention": "6C",
                    "ref_id": "FIGREF5"
                }
            ]
        },
        {
            "text": "Subsequent analyses of expressed GFP-GN fusion proteins with subcellular fractionation approaches were performed to confirm the association of the fusion proteins with cellular membranes and to demonstrate the transition of intracellular localization from a diffuse cytoplasmic to a Golgi complex region pattern (Fig. 8). For this, membrane-associated cellular proteins were separated from soluble proteins and the different fractions analyzed via immunoblot using GFP-specific antibodies. As expected, constructs GFP GNI, GFP GNA, and GFP GNB, containing only the TM I, 87 or 99 amino acids from the predicted GN cytoplasmic domain, respectively, were only detected in the soluble fraction (Fig. 8a; only shown for GNB), whereas GFP GNC and constructs with longer parts from the GN cytoplasmic domain including the TM II region were detected mainly in the pellet fraction containing membrane-associated proteins (Fig. 8b). Constructs with longer fragments of the GN cytoplasmic domain, including additional TM regions, were exclusively detected within the pellet fraction (e.g., GFP GNG; Fig. 8c). These results confirmed our previous findings that the addition of GN TM II results in a change of intracellular protein localization and seems to mediate targeting to Golgi membranes.",
            "cite_spans": [],
            "section": "Signals for intracellular targeting of CCHFV glycoproteins ::: Results",
            "ref_spans": [
                {
                    "start": 318,
                    "end": 319,
                    "mention": "8",
                    "ref_id": "FIGREF7"
                },
                {
                    "start": 697,
                    "end": 699,
                    "mention": "8a",
                    "ref_id": "FIGREF7"
                },
                {
                    "start": 919,
                    "end": 921,
                    "mention": "8b",
                    "ref_id": "FIGREF7"
                },
                {
                    "start": 1094,
                    "end": 1096,
                    "mention": "8c",
                    "ref_id": "FIGREF7"
                }
            ]
        },
        {
            "text": "Enveloped viruses, which do not acquire their lipoprotein coat by budding through the plasma membrane bud at internal membranes, including the inner nuclear membrane (herpesviruses;[43], the ER (flaviviruses and rotaviruses; [44,45], the intermediate compartment (ERGIC) (coronaviruses and poxviruses; [46,47], and the Golgi complex (rubellaviruses, coronaviruses, and bunyaviruses; [4,46,48]. Usually, the accumulation of the viral surface proteins in the specific intracellular compartment determines the assembly and budding site of the virus. This intracellular accumulation is dependent on certain compartment-specific retention or retrieval signals.",
            "cite_spans": [
                {
                    "start": 182,
                    "end": 184,
                    "mention": "43",
                    "ref_id": "BIBREF37"
                },
                {
                    "start": 226,
                    "end": 228,
                    "mention": "44",
                    "ref_id": "BIBREF38"
                },
                {
                    "start": 229,
                    "end": 231,
                    "mention": "45",
                    "ref_id": "BIBREF39"
                },
                {
                    "start": 303,
                    "end": 305,
                    "mention": "46",
                    "ref_id": "BIBREF40"
                },
                {
                    "start": 306,
                    "end": 308,
                    "mention": "47",
                    "ref_id": "BIBREF41"
                },
                {
                    "start": 384,
                    "end": 385,
                    "mention": "4",
                    "ref_id": "BIBREF33"
                },
                {
                    "start": 386,
                    "end": 388,
                    "mention": "46",
                    "ref_id": "BIBREF40"
                },
                {
                    "start": 389,
                    "end": 391,
                    "mention": "48",
                    "ref_id": "BIBREF42"
                }
            ],
            "section": "Discussion",
            "ref_spans": []
        },
        {
            "text": "For almost all bunyaviruses assembly and budding takes place in the Golgi region [4,46,48]. However, so far no common motifs could be identified for signals within bunyaviral glycoproteins resulting in Golgi targeting and accumulation. Indeed, even the locations of such signals within bunyaviral glycoproteins are different. For the phlebovirus Uukuniemi (UUK), a Golgi retention signal could be identified within the membrane-proximal half (aa1040) of the 81 aa long cytoplasmic domain of GN [30,31,38]. In contrast, for the phlebovirus Punto Toro, such signals were mapped to the transmembrane domain (TM) and the adjacent amino acids of the GN cytoplasmic domain [36,37]. A similar localization was recently described for the Golgi retention signal in the GN of the phlebovirus Rift Valley Fever (RVF) virus GN [34]. Notable, for the Old World hantavirus Hantaan (HTN) it was reported that the conformation of the GN/GC complex might play a more important role for Golgi accumulation than an actual primary sequence motif [39].",
            "cite_spans": [
                {
                    "start": 82,
                    "end": 83,
                    "mention": "4",
                    "ref_id": "BIBREF33"
                },
                {
                    "start": 84,
                    "end": 86,
                    "mention": "46",
                    "ref_id": "BIBREF40"
                },
                {
                    "start": 87,
                    "end": 89,
                    "mention": "48",
                    "ref_id": "BIBREF42"
                },
                {
                    "start": 495,
                    "end": 497,
                    "mention": "30",
                    "ref_id": "BIBREF23"
                },
                {
                    "start": 498,
                    "end": 500,
                    "mention": "31",
                    "ref_id": "BIBREF24"
                },
                {
                    "start": 501,
                    "end": 503,
                    "mention": "38",
                    "ref_id": "BIBREF31"
                },
                {
                    "start": 668,
                    "end": 670,
                    "mention": "36",
                    "ref_id": "BIBREF29"
                },
                {
                    "start": 671,
                    "end": 673,
                    "mention": "37",
                    "ref_id": "BIBREF30"
                },
                {
                    "start": 816,
                    "end": 818,
                    "mention": "34",
                    "ref_id": "BIBREF27"
                },
                {
                    "start": 1027,
                    "end": 1029,
                    "mention": "39",
                    "ref_id": "BIBREF32"
                }
            ],
            "section": "Discussion",
            "ref_spans": []
        },
        {
            "text": "While extensive studies have been performed regarding intracellular budding sites and glycoprotein accumulation for members of the genera Orthobunyavirus, Phlebovirus, Hantavirus and Tospovirus [30,32,34-36,39,40], nothing is known for members of the genus Nairovirus. Here we demonstrated, for the first time, that the CCHFV GN protein is membrane associated and contains a Golgi localization motif. In addition we have mapped this signal to a hydrophobic region (TM II) within the predicted cytoplasmic tail [5]. Co-expressed GN and GC result in a specific Golgi accumulation and co-localization using specific Golgi markers, whereas individual expressed GC is retained in the ER. These results imply that the two CCHFV glycoproteins have to interact and form hetero-oligomers for a proper Golgi transport of GC.",
            "cite_spans": [
                {
                    "start": 195,
                    "end": 197,
                    "mention": "30",
                    "ref_id": "BIBREF23"
                },
                {
                    "start": 198,
                    "end": 200,
                    "mention": "32",
                    "ref_id": "BIBREF25"
                },
                {
                    "start": 201,
                    "end": 203,
                    "mention": "34",
                    "ref_id": "BIBREF27"
                },
                {
                    "start": 204,
                    "end": 206,
                    "mention": "36",
                    "ref_id": "BIBREF29"
                },
                {
                    "start": 207,
                    "end": 209,
                    "mention": "39",
                    "ref_id": "BIBREF32"
                },
                {
                    "start": 210,
                    "end": 212,
                    "mention": "40",
                    "ref_id": "BIBREF34"
                },
                {
                    "start": 511,
                    "end": 512,
                    "mention": "5",
                    "ref_id": "BIBREF44"
                }
            ],
            "section": "Discussion",
            "ref_spans": []
        },
        {
            "text": "GFP-fusion proteins containing different portions of the CCHF GN glycoprotein allowed mapping of the Golgi targeting sequence within the cytoplasmic domain. Interestingly, we located the signal downstream of the predicted protease cleavage site RKLL at position 808 of the CCHFV precursor GPC, responsible for generating the C-terminus of the mature GN protein [5,28], implying that this cleavage site might not be used during the maturation process of GN. Furthermore, we could demonstrate that the addition of only the hydrophobic region from the predicted TM II within the GN cytoplasmic domain targeted a GFP-fusion protein to the Golgi complex. This shows that the 23 amino acids of TM II are sufficient and necessary for targeting GFP to the Golgi region, whereas the first 99 amino acids from the cytoplasmic domain and the TM I domain do not contribute to Golgi targeting.",
            "cite_spans": [
                {
                    "start": 362,
                    "end": 363,
                    "mention": "5",
                    "ref_id": "BIBREF44"
                },
                {
                    "start": 364,
                    "end": 366,
                    "mention": "28",
                    "ref_id": "BIBREF20"
                }
            ],
            "section": "Discussion",
            "ref_spans": []
        },
        {
            "text": "The results obtained from the GFP-GN fusion proteins seem contradictory to the studies with the GN expression plasmid. IFA data combined with confocal microscopy co-localization studies of cells transfected with GNs expression plasmids demonstrated a clear Golgi complex staining (Fig. 3A: b, g; Fig. 4e). Since GNs contains only the first 87 amino acids of the predicted cytoplasmic domain without the predicted TM II sequence, we expected that the corresponding GFP-fusion protein GFP-GNA would show similar intracellular localization. However, the diffuse staining throughout the cytoplasm of transfected cells demonstrates that the first 87 amino acids are not sufficient to target the GFP to the Golgi complex (GFP-GNA; Figs. 6B and 6C: c). A possible explanation for this discrepancy is the existence of a second Golgi localization signal located within the GN ectodomain. Such a signal would be the reason for the Golgi localization pattern of GNs, whereas GFP-GNC and fusion proteins containing longer fragments of the predicted GN cytoplasmic domain localize to the Golgi region because of a Golgi localization signal located in TM II.",
            "cite_spans": [],
            "section": "Discussion",
            "ref_spans": [
                {
                    "start": 286,
                    "end": 288,
                    "mention": "3A",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 301,
                    "end": 303,
                    "mention": "4e",
                    "ref_id": "FIGREF3"
                },
                {
                    "start": 731,
                    "end": 733,
                    "mention": "6B",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 738,
                    "end": 740,
                    "mention": "6C",
                    "ref_id": "FIGREF5"
                }
            ]
        },
        {
            "text": "CCHFV GC protein expressed by its own retained in the ER and did not relocate into the Golgi complex. Interestingly, similar to all described GC proteins of phleboviruses CCHFV GC proteins also contain a lysine-based ER retrieval signal (KKXX; [49] within the predicted cytoplasmic domain. In case of single expressed GC protein this signal is most likely responsible for the ER localization of the protein, even though GFP-CCHF GCA fusion proteins containing only the predicted TM showed perinuclear staining pattern (Figs. 6B and 6C: m). However, co-expression with GN protein leads to interaction between these two proteins most likely resulting in masking of the ER retrieval signal and an accumulation of the heterodimer in the Golgi complex, due to the Golgi retention signal(s) located on GN (Fig. 3A: d, e, i, j; Fig. 4g). A similar phenomenon with conflicting transport/targeting signals was previously described for the rubellavirus E1 and E2 proteins [48,50,51].",
            "cite_spans": [
                {
                    "start": 245,
                    "end": 247,
                    "mention": "49",
                    "ref_id": "BIBREF43"
                },
                {
                    "start": 963,
                    "end": 965,
                    "mention": "48",
                    "ref_id": "BIBREF42"
                },
                {
                    "start": 966,
                    "end": 968,
                    "mention": "50",
                    "ref_id": "BIBREF45"
                },
                {
                    "start": 969,
                    "end": 971,
                    "mention": "51",
                    "ref_id": "BIBREF46"
                }
            ],
            "section": "Discussion",
            "ref_spans": [
                {
                    "start": 525,
                    "end": 527,
                    "mention": "6B",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 532,
                    "end": 534,
                    "mention": "6C",
                    "ref_id": "FIGREF5"
                },
                {
                    "start": 805,
                    "end": 807,
                    "mention": "3A",
                    "ref_id": "FIGREF2"
                },
                {
                    "start": 826,
                    "end": 828,
                    "mention": "4g",
                    "ref_id": "FIGREF3"
                }
            ]
        },
        {
            "text": "In conclusion, we were able to express CCHF GN and GC glycoproteins individually as well as from the precursor GPC. GN could be localized to the Golgi compartment, whereas GC was found in the ER. Co-expression of both proteins resulted in Golgi rescue of GC, indicating that proper interaction between GN and GC is important for transportation of the heterodimer out of the ER. The potential Golgi targeting signal could be localized to a hydrophobic region within the cytoplasmic domain in the GN protein. Furthermore, our results suggest that additional signals could be localized within the GN ectodomain.",
            "cite_spans": [],
            "section": "Conclusion",
            "ref_spans": []
        },
        {
            "text": "Further characterization of the CCHFV GN Golgi retention signals could provide helpful information to understand the proteolytic cleavage event(s) of the GPC and the glycoprotein maturation process. The different CCHFV G expression plasmids might show also useful for the generation of virus-like particles (VLPs) as well as for identification of interaction sites between the viral glycoproteins and the ribonucleoproteins.",
            "cite_spans": [],
            "section": "Conclusion",
            "ref_spans": []
        },
        {
            "text": "The identification of the potential budding site(s) of nairoviruses and the detailed analysis of the Golgi localization signal of the CCHFV GN protein will allow subsequent studies for targeting the glycoprotein accumulation during the development of antiviral strategies or even for rational vaccine design.",
            "cite_spans": [],
            "section": "Conclusion",
            "ref_spans": []
        },
        {
            "text": "BHK-21 (baby hamster kidney), 293T (human embryonic kidney), VeroE6 (African green monkey kidney) and SW13 cells (human adenocarcinoma cells)(American Type Culture Collection) were grown on plastic dishes in Glasgow (BHK-21), Eagle's minimal essential (293T, VeroE6), or Leibovitz L15 (SW13) medium, respectively, supplemented with 5 to 10% fetal calf serum, 2 mM L-glutamine, 100 IU of penicillin/ml, and 100 μg of streptomycin/ml (Invitrogen). The CCHFV, strain IbAr10200, isolated in 1970 from ticks (Hyalomma excavatum) in Nigeria (Sokoto), kindly provided by Special Pathogens Branch, Centers for Disease Control and Prevention, Atlanta (T. G. Ksiazek), was used for all experiments. The CCHFV stocks were prepared on SW13 cells by infection of T162 cell culture flasks with a 1:100 dilution. Supernatant was collected three days post infection (p.i.), clarified from cell debris by low speed centrifugation (3,000 × g, 10 min, 4°C), and aliquots were stored in liquid nitrogen. Virus titers were determined either by plaque assay or 50% tissue culture infectious dose assay (TCID50).",
            "cite_spans": [],
            "section": "Cells and virus ::: Methods",
            "ref_spans": []
        },
        {
            "text": "Total RNA was isolated 7 days post infection from VeroE6 cells infected with CCHFV (1:1000 dilution of virus stock; 10-3 pfu, RNA sample #1). Additional CCHFV RNA was kindly provided by J. Smith, USAMRIID, Alphavax, Durham, N.C. (RNA sample #2). CCHFV specific M segment vRNA or cRNA molecules were reverse transcribed using the primers CCHF M1 (TCTCAAAGAAATAGTGGCGGCACGCAGTC) or CCHF M2 (TCTCAAAGAAATACTTGCGGCACGTCAGT) for the reverse transcription reaction, respectively. The resulting cDNA molecules were used as templates for subsequent PCR reactions producing overlapping PCR fragments covering the entire CCHFV M segment. PCR products were inserted into pCR4 using the TOPO TA cloning kit (Invitrogen). Prior to sequence determination, positive clones were screened by PCR technology (primer TOPO F: AGCTCGGATCCACTAGTAACG and TOPO R: ATGCTCGAGCGGCCGCCAGTG) and restriction enzyme digest (EcoRI). For vRNA and cRNA-based constructs three of the cloning plasmids were sequenced using primers specific for the M segment ORF. The sequence results were aligned to the genebank sequence U39455 using the Align Plus 5 program of the Clone Manager Professional Suite 6 (Scientific & Educational Software). Determined nucleotide exchanges and the corresponding amino acid differences are listed in Table 1. For sequence determination of the M segment ends CCHFV specific vRNA and cRNA molecules were ligated using T4 RNA ligase (Roche) prior to the reverse transcription reaction (vRNA: M32: AGAACCAGAGGCCTGTTCAA, cRNA: M33: AAGGTGTCTGTGCCGGTTGT). Subsequent PCR amplification with primers CCHF M34 (AATACTAGTCTAAT CCACTGGCTGGTGTT) and M35 (AATGAATTCTGCCGAACTGTTCTCTAC) generated fragments containing both segment ends. PCR products were inserted into pCR4 (Invitrogen) for direct sequence determination as described above. In total, 12 cRNA/mRNA and 37 vRNA clones were analyzed using T7 and T3 promoter-specific primers.",
            "cite_spans": [],
            "section": "Sequence determination of the full-length CCHFV M segment ::: Methods",
            "ref_spans": [
                {
                    "start": 1301,
                    "end": 1302,
                    "mention": "1",
                    "ref_id": "TABREF0"
                }
            ]
        },
        {
            "text": "Based on the recently published N-terminal sequence determination of mature CCHFV glycoproteins [5], expression plasmids for both glycoproteins were generated. In case of the CCHFV GN two constructs were generated since the C terminus of the mature GN is not yet experimentally determined: pCMV CCHF GN \"short\" (GNs) contains the GN-ORF from pos. 519 to 807, preceding the predicted C-terminal cleavage site RKLL at position 808 (44). pCMV CCHF GN \"long\" (GNl) consists of pos. 519 to 1040 extending the GN-ORF to the experimentally determined N-terminal end of GC. The PCR fragments (GNs: RF346/352, GNl: RF353/352) were inserted after BsmBI endonuclease treatment into pDisplay (Invitrogen) previously digested with BglII/XmaI digest, resulting in CMV-driven (human cytomegalovirus immediate early promoter and enhancer) expression plasmids for CCHFV GN. The Ig κ-chain signal peptide sequence and the hemagglutinin A (HA) epitope of the pDisplay vector were used for correct intracellular processing and detection, respectively. The CCHFV GC was PCR-amplified using primers CCHF M9 (AGTTGGTCTAGCCAATGTGTG) and RF351 (AATCGTCTCAAATTCATGGAGAC AGACACACTCCTGCTATGGGTACTGCTGCTCTGGGTTCCAGGTTCCACTGGTGACTTCCTAGATAGTACAGCTAAAGGCATG) (pos. 1041 to 1684).",
            "cite_spans": [
                {
                    "start": 97,
                    "end": 98,
                    "mention": "5",
                    "ref_id": "BIBREF44"
                }
            ],
            "section": "CCHFV glycoprotein expression plasmids ::: Methods",
            "ref_spans": []
        },
        {
            "text": "BsmBI- and XhoI-restricted PCR fragments were inserted into the plasmid pCAGGS/MCS [52] prior digested with EcoRI/XhoI digest, resulting in a chicken β-actin-driven expression plasmid for CCHFV GC. For correct intracellular processing of the CCHFV GC we inserted the Ig κ-chain signal peptide of the pDisplay vector via forward oligonucleotide primer RF351.",
            "cite_spans": [],
            "section": "CCHFV glycoprotein expression plasmids ::: Methods",
            "ref_spans": []
        },
        {
            "text": "Different expression strategies (CMV-, chicken β-actin-driven) were used for the different CCHFV glycoproteins to yield maximum expression levels.",
            "cite_spans": [],
            "section": "CCHFV glycoprotein expression plasmids ::: Methods",
            "ref_spans": []
        },
        {
            "text": "CCHFV glycoprotein expression plasmid DNA was transfected into subconfluent BHK-21 or 293T cells (3 × 106) using 2 to 4 μg of the respective plasmid and 8 μl of liposome plus buffer (LipofectAMINE PLUS; Life Technologies, Invitrogen) mixed in serum-free MEM and incubated for 15 min at room temperature. After addition of 12 μl of liposome reagent, incubation was continued for a further 15 min. The cells were incubated at 37°C with the DNA-Lipofectamine mixture for 3 h. To determine the efficiency of transfection, plasmid pHL2823, expressing enhanced GFP (EGFP) under the CMV immediate early promoter and enhancer (R. Flick and G. Hobom, unpublished), was transfected similarly. After further incubation for 20–24 h in MEM containing 2% FCS, the transfected cells were fixed and CCHFV glycoprotein expression levels determined using indirect immunofluorescence assays (IFA).",
            "cite_spans": [],
            "section": "Transfection ::: Methods",
            "ref_spans": []
        },
        {
            "text": "293T or BHK-21 cells grown on coverslips within a 6-well dish were transfected as described above. After 20 to 44 h, cycloheximide (final concentration of 0.18 mM) was added when indicated to inhibit further protein synthesis. The cells were incubated for an additional 2 to 5 h and then washed with phosphate buffer saline (PBS, pH 7.5) and fixed in methanol:acetone (50:50, V/V) for 20 min at -20°C. Permeabilization was omitted by fixation with paraformaldehyde when surface-expressed proteins were to be detected. After fixation, cells were washed with PBS and blocked for at least 30 min with PBS containing 5 % bovine serum albumin (BSA). Poly- or monoclonal antisera were diluted in PBS containing 1 % BSA and incubated for 1 h at room temperature. After several washes with PBS, goat anti-rabbit or mouse immunoglobulin secondary antibodies conjugated to fluorescein isothiocyanate (FITC) or tetramethyl rhodamin isothiocyanate (TRITC) were incubated with the cells for 45 to 60 min at room temperature. Procedures were repeated for double labeling with a different antiserum and fluorescent probe, and at the end of the procedure the slides were washed with PBS overnight.",
            "cite_spans": [],
            "section": "Indirect immunofluorescence assay ::: Methods",
            "ref_spans": []
        },
        {
            "text": "Intracellular localization of the glycoproteins GN was determined by co-localization with commercially available organelle-specific fluorescent dyes (Molecular Probe Inc., Oregon, USA): BODIPY-TR C5 ceramide was selected as an indicator of the Golgi region. In addition Golgi (mannosidase II; Sigma) and ER-specific (Calreticulin; Sigma) monoclonal or polyclonal antibodies were used.",
            "cite_spans": [],
            "section": "Indirect immunofluorescence assay ::: Methods",
            "ref_spans": []
        },
        {
            "text": "Sample preparation and immunocytochemical staining were the same as for wide-field fluorescence microscopy. The fluorescence staining patterns were analysed with a ZEISS LSM 510 UV META laser scanning confocal microscope (Jena, Germany) equipped with a Coherent Enterprise II 81 mW Argon UV laser, a Lasos 30 mW Argon laser, and 5 mW HeNe laser. Images were acquired with a C-apochromat 63/1.2 corr. water-immersion lens. FITC-stained proteins were imaged with excitation at 488 nm and with a 505 to 530 nm bandpass emission filter. Golgi marker BODIPY-TR C5 ceramide were imaged with excitation at 543 nm and with a 570 to 655 nm bandpass emission. DAPI-stained DNA was imaged with excitation at 364 nm and emission through a 385 to 470 bandpass filter. Merged pictures for analysis of intracellular co-localization were generated using Zeiss LSM Image Brower 3.2 software.",
            "cite_spans": [],
            "section": "Confocal Microscopy ::: Methods",
            "ref_spans": []
        },
        {
            "text": "Alkaline carbonate extraction was performed on BHK-21 cells 24–48 h post transfection. The protocol described in Current Protocols in Cell Biology Online, John Wiley & Sons, Inc. was followed. Briefly, BHK-21 cells were transfected with individual constructs as described before. At 24 to 48 h post transfection, supernatant was removed and cells were washed three times with PBS followed by an additional washing step with 100 ml NaCl. Occasionally, the transfected cells would detach from the plate thus, the non-adherent cells were isolated between washes by microcentrifugation (2 min at 1000 × g). Remaining cells were scraped (adherent) or resuspended (non-adherent) into 1 ml of ice-cold 100 mM sodium carbonate, pH 11.5 and homogenized (five strokes) in a 2 ml Dounce homogenizer. The homogenate was then incubated for 30 min on ice and 1 ml of sodium carbonate was added to attain the necessary volume for subsequent ultracentrifugation (2 ml). The homogenate was then centrifuged for 60 min at 50.000 rpm using a TLS-55 rotor (Beckman) at 4°C. Following centrifugation, the supernatant was transferred to a fresh tube and concentrated three to five times. The pellet was resuspended in 250 μl of sodium carbonate. Pellet and supernatant fractions were then mixed with 4× SDS-PAGE sample buffer containing β-mercaptoethanol and run on SDS-PAGE. Protein gels were then transferred to PVDF transfer membrane (Amersham Biosciences) using a Trans-blot SD semi-dry transfer apparatus (Bio-Rad). Proteins were subsequently visualized by immunoblot.",
            "cite_spans": [],
            "section": "Membrane Fractionation ::: Methods",
            "ref_spans": []
        },
        {
            "text": "Following transfer, the blot was blocked overnight in 5 % skim milk + 0.1 % Tween. The following morning, the blot was washed three times with PBS/0.1 % Tween then incubated with the primary antibody, e.g. anti-GFP (Oncogene) at a 1:2000 dilution in PBS for 1 h at room temperature with rocking. The blot was then washed three times with PBS/0.1 % Tween and incubated with the secondary antibody, goat anti rabbit HRP (Sigma) at a 1:30.000 dilution in PBS for 1 h at room temperature with rocking. The blot was then washed with PBS/0.1 %Tween three times, followed by three washes with PBS. Proteins were visualized using the ECL+plus Western Blotting Detection system (Amersham Biosciences).",
            "cite_spans": [],
            "section": "Western Blot ::: Methods",
            "ref_spans": []
        },
        {
            "text": "SH carried out the described cloning work, confocal microscopy studies and the GFP-fusion protein analysis. LF carried out the membrane fractionation. TS revised the manuscript critically. HF helped to draft the manuscript and revised it critically. RF designed the study and coordinated and helped to draft the manuscript. All authors read and approved the final manuscript.",
            "cite_spans": [],
            "section": "Authors' contributions",
            "ref_spans": []
        }
    ],
    "ref_entries": {
        "TABREF0": {
            "text": "Table 1: Sequence comparison of available CCHFV IbAr10200 M segment sequences\n* based on [GenBank: U39455] position numbering",
            "type": "table"
        },
        "TABREF1": {
            "text": "Table 2: Features and construction details of different GFP-CCHFV G fusion proteins\n* based on [GenBank: U39455] position numbering",
            "type": "table"
        },
        "FIGREF0": {
            "text": "Figure 1: Schematic presentation of the predicted base-paired ends of the CCHFV M vRNA segment. The first nine nucleotides as well as nucleotides at position 11 at both RNA ends are highly conserved within the three genome segments (bold, italics), whereas the first thirteen nucleotides at the 3' and 5' vRNA ends are inverted complementary and can form base-paired terminal regions.",
            "type": "figure"
        },
        "FIGREF1": {
            "text": "Figure 2: Western blotting of CCHFV glycoproteins after transfection of different expression plasmids. BHK-21 cells were either infected with CCHFV (lane 1) or transfected with individual CCHFV glycoprotein expression plasmids (lanes 2–5). Twenty-four hours post infection/transfection cells were harvested and cell lysate used for western blotting, using immune serum specific against CCHFV IbAr10200. Protein bands with expected sizes were detected and confirmed successful expression of CCHFV glycoproteins.",
            "type": "figure"
        },
        "FIGREF2": {
            "text": "Figure 3: Indirect immunofluorescence assays of CCHFV glycoproteins after transfection of different expression plasmids. BHK-21 and 293T cells were transfected with CCHFV glycoprotein expression plasmids. Twenty-four hours post transfection cells were fixed and stained with CCHFV-specific or anti-HA antibodies. A: Cells fixed with methanol/acetone allow analyses of intracellular proteins. Polyclonal antibodies against CCHFV GC were used for GC detection (a, f). CCHFV GN expression from two different CMV-driven expression plasmids was analyzed using anti-HA tag antibodies (b, c, g, h). GN and GC expressed from the GPC were studied using polyclonal anti-CCHFV antibodies (d, i) as well as specific antipeptide antibodies against GN and GC (data not shown). CCHFV-infected cells served as controls (e, j). B: Cells fixed with paraformaldehyde were analyzed for CCHFV G expression on cellular surfaces. GC was stained using anti-CCHFV GC antibodies, GN with anti-HA tag, and mature CCHFV proteins derived from the GPC with anti-CCHFV antibodies. No clearly visible staining correlates with no detectable surface expression.",
            "type": "figure"
        },
        "FIGREF3": {
            "text": "Figure 4: Intracellular co-localization studies of CCHFV glycoproteins and cellular compartment markers. BHK-21 cells were either infected with CCHFV or transfected with individual CCHFV glycoprotein expression plasmids. Twenty-four hours post infection/transfection cells were fixed with methanol/acetone and subsequently an indirect immunofluorescence assay was performed. DAPI-stained (for nucleus localization), Golgi or ER compartment stained and CCHFV G expression pictures were taken individually and subsequently merged to study the intracellular CCHFV G localization. a: CCHFV-infected cells stained for CCHF GN and GC proteins; b and c: CCHFV GPC expression plasmid-transfected cells stained for GN or GC, respectively; d: Cells transfected with CCHFV GC expression plasmid stained with GC-specific antibodies and co-stained with ER compartment marker calreticulin; e: CCHFV GNs-transfected cells stained with HA tag-specific antibodies; f: CCHFV GNl-transfected cells stained with HA tag-specific antibodies; g: CCHFV GC expression pattern after co-transfection of CCHFV GNl and GC.",
            "type": "figure"
        },
        "FIGREF4": {
            "text": "Figure 5: Subcellular fractionation studies of expressed CCHFV glycoproteins. CCHFV-infected or CCHFV G expression plasmid-transfected BHK-21 cells were used for a subcellular fractionation study to determine if CCHFV G proteins are membrane associated. The results shown are summarized from two independent experiments. M: membrane fraction, S: soluble fraction, N: CCHF nucleoprotein, Man II: Mannosidase II. For quantification individual protein bands were analyzed and compared using the software Quantity One (BioRad).",
            "type": "figure"
        },
        "FIGREF5": {
            "text": "Figure 6: GFP-CCHFV G fusion proteins to identify Golgi and ER localization signals. BHK-21 and 293T cells were transfected with individual GFP-CCHFV G fusion proteins. Twenty-four hours post transfection cells were analyzed via UV microscopy. A: Schematic presentation of different GFP-CCHFV G fusion proteins. Green labeled parts represent the GFP protein, red and blue labeled parts show the fragments of the CCHFV G cytoplasmic tails C-terminal fused to the GFP gene. White boxes symbolize the predicted hydrophobic transmembrane domains (TM). Numbers represent the amino acid position from the CCHFV GPC; B: BHK-21 cell analyses; C: 293T cell analyses.",
            "type": "figure"
        },
        "FIGREF6": {
            "text": "Figure 7: Intracellular co-localization analysis of GFP-CCHFV G fusion proteins. 293T cells were transfected with a GFP-CCHFV GN fusion protein construct encoding 123 amino acids from the GN cytoplasmic tail (GFP GNC). Twenty-four hours later cells were fixed with methanol/acetone. A subsequent indirect immunofluorescence using the Golgi compartment marker mannosidase II was performed and analyzed via UV microscopy. The merged picture clearly demonstrates the Golgi localization of the fusion protein.",
            "type": "figure"
        },
        "FIGREF7": {
            "text": "Figure 8: Subcellular fractionation studies of expressed GFP-CCHFV G fusion proteins. Expression plasmids for GFP-CCHFV glycoprotein fusion protein were transfected into BHK-21 cells and used for a subcellular fractionation study to determine if fusion proteins containing different parts from the CCHFV GN cytoplasmic domain are soluble or membrane associated. A GFP-specific antibody was used for the immunoblot. Representative results from three constructs are shown. M: membrane fraction, S: soluble fraction.",
            "type": "figure"
        }
    },
    "back_matter": [],
    "bib_entries": {
        "BIBREF0": {
            "title": "7th report of the International Committee of Taxonomy of Viruses",
            "authors": [
                {
                    "first": "MHV",
                    "middle": [],
                    "last": "van Regenmortel",
                    "suffix": ""
                },
                {
                    "first": "CM",
                    "middle": [],
                    "last": "Fauquet",
                    "suffix": ""
                },
                {
                    "first": "DML",
                    "middle": [],
                    "last": "Bishop",
                    "suffix": ""
                },
                {
                    "first": "EB",
                    "middle": [],
                    "last": "Carstens",
                    "suffix": ""
                },
                {
                    "first": "MK",
                    "middle": [],
                    "last": "Estes",
                    "suffix": ""
                },
                {
                    "first": "SM",
                    "middle": [],
                    "last": "Lemon",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Maniloff",
                    "suffix": ""
                },
                {
                    "first": "MA",
                    "middle": [],
                    "last": "Mago",
                    "suffix": ""
                },
                {
                    "first": "DJ",
                    "middle": [],
                    "last": "McGeoch",
                    "suffix": ""
                },
                {
                    "first": "CR",
                    "middle": [],
                    "last": "Pringle",
                    "suffix": ""
                },
                {
                    "first": "RB",
                    "middle": [],
                    "last": "Wicknen",
                    "suffix": ""
                }
            ],
            "year": 2000,
            "venue": "Virus Taxonomy",
            "volume": "",
            "issn": "",
            "pages": "599-621",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF1": {
            "title": "Biological and clinical responses of west African sheep to Crimean-Congo haemorrhagic fever virus experimental infection",
            "authors": [
                {
                    "first": "JP",
                    "middle": [],
                    "last": "Gonzalez",
                    "suffix": ""
                },
                {
                    "first": "JL",
                    "middle": [],
                    "last": "Camicas",
                    "suffix": ""
                },
                {
                    "first": "JP",
                    "middle": [],
                    "last": "Cornet",
                    "suffix": ""
                },
                {
                    "first": "ML",
                    "middle": [],
                    "last": "Wilson",
                    "suffix": ""
                }
            ],
            "year": 1998,
            "venue": "Res Virol",
            "volume": "149",
            "issn": "",
            "pages": "445-455",
            "other_ids": {
                "DOI": [
                    "10.1016/S0923-2516(99)80013-2"
                ]
            }
        },
        "BIBREF2": {
            "title": "Clinical picture of Crimean hemorrhagic fever (in Russian)",
            "authors": [
                {
                    "first": "EV",
                    "middle": [],
                    "last": "Leshchinskaya",
                    "suffix": ""
                }
            ],
            "year": 1965,
            "venue": "(in English: NAMRU3-1856)",
            "volume": "7",
            "issn": "",
            "pages": "226-236 (in English: NAMRU3-1856)",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF3": {
            "title": "Endemic infectious diseases of the Middle East",
            "authors": [
                {
                    "first": "EC",
                    "middle": [],
                    "last": "Oldfield",
                    "suffix": ""
                },
                {
                    "first": "MR",
                    "middle": [],
                    "last": "Wallace",
                    "suffix": ""
                },
                {
                    "first": "KC",
                    "middle": [],
                    "last": "Hyams",
                    "suffix": ""
                },
                {
                    "first": "AA",
                    "middle": [],
                    "last": "Yousif",
                    "suffix": ""
                },
                {
                    "first": "DE",
                    "middle": [],
                    "last": "Lewis",
                    "suffix": ""
                },
                {
                    "first": "AL",
                    "middle": [],
                    "last": "Bourgeois",
                    "suffix": ""
                }
            ],
            "year": 1991,
            "venue": "Rev Infect Dis",
            "volume": "13 Suppl 3",
            "issn": "",
            "pages": "S199-217",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF4": {
            "title": "Experimental studies on the replication and transmission of Crimean-Congo hemorrhagic fever virus in some African tick species",
            "authors": [
                {
                    "first": "AJ",
                    "middle": [],
                    "last": "Shepherd",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Swanepoel",
                    "suffix": ""
                },
                {
                    "first": "AJ",
                    "middle": [],
                    "last": "Cornel",
                    "suffix": ""
                },
                {
                    "first": "O",
                    "middle": [],
                    "last": "Mathee",
                    "suffix": ""
                }
            ],
            "year": 1989,
            "venue": "Am J Trop Med Hyg",
            "volume": "40",
            "issn": "",
            "pages": "326-331",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF5": {
            "title": "Nairovirus Infections",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Swanepoel",
                    "suffix": ""
                }
            ],
            "year": 1995,
            "venue": "Exotic Viral Infections",
            "volume": "",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF6": {
            "title": "The clinical pathology of Crimean-Congo hemorrhagic fever",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Swanepoel",
                    "suffix": ""
                },
                {
                    "first": "DE",
                    "middle": [],
                    "last": "Gill",
                    "suffix": ""
                },
                {
                    "first": "AJ",
                    "middle": [],
                    "last": "Shepherd",
                    "suffix": ""
                },
                {
                    "first": "PA",
                    "middle": [],
                    "last": "Leman",
                    "suffix": ""
                },
                {
                    "first": "JH",
                    "middle": [],
                    "last": "Mynhardt",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Harvey",
                    "suffix": ""
                }
            ],
            "year": 1989,
            "venue": "Rev Infect Dis",
            "volume": "11 Suppl 4",
            "issn": "",
            "pages": "S794-800",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF7": {
            "title": "Crimean-Congo hemorrhagic fever",
            "authors": [
                {
                    "first": "DMTGKKJLHH",
                    "middle": [],
                    "last": "Watts",
                    "suffix": ""
                }
            ],
            "year": 1988,
            "venue": "The arboviruses: epidemiology and ecology",
            "volume": "",
            "issn": "",
            "pages": "177-222",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF8": {
            "title": "Characteristics of Crimean-Congo hemorrhagic fever virus (Xinjiang strain) in China",
            "authors": [
                {
                    "first": "YC",
                    "middle": [],
                    "last": "Yen",
                    "suffix": ""
                },
                {
                    "first": "LX",
                    "middle": [],
                    "last": "Kong",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Lee",
                    "suffix": ""
                },
                {
                    "first": "YQ",
                    "middle": [],
                    "last": "Zhang",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Li",
                    "suffix": ""
                },
                {
                    "first": "BJ",
                    "middle": [],
                    "last": "Cai",
                    "suffix": ""
                },
                {
                    "first": "SY",
                    "middle": [],
                    "last": "Gao",
                    "suffix": ""
                }
            ],
            "year": 1985,
            "venue": "Am J Trop Med Hyg",
            "volume": "34",
            "issn": "",
            "pages": "1179-1182",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF9": {
            "title": "The epidemiology of tickborne Crimean-Congo hemorrhagic fever in Asia, Europe and Africa (Review)",
            "authors": [
                {
                    "first": "H",
                    "middle": [],
                    "last": "Hoogstral",
                    "suffix": ""
                }
            ],
            "year": 1979,
            "venue": "J Med Entomol",
            "volume": "15",
            "issn": "",
            "pages": "307-417",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF10": {
            "title": "Crimean-Congo haemorrhagic fever in Oman",
            "authors": [
                {
                    "first": "TF",
                    "middle": [],
                    "last": "Schwarz",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Nitschko",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Jager",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Nsanze",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Longson",
                    "suffix": ""
                },
                {
                    "first": "RN",
                    "middle": [],
                    "last": "Pugh",
                    "suffix": ""
                },
                {
                    "first": "AK",
                    "middle": [],
                    "last": "Abraham",
                    "suffix": ""
                }
            ],
            "year": 1995,
            "venue": "Lancet",
            "volume": "346",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": [
                    "10.1016/S0140-6736(95)92936-3"
                ]
            }
        },
        "BIBREF11": {
            "title": "Bunyaviridae genome structure and gene expression",
            "authors": [
                {
                    "first": "RM",
                    "middle": [],
                    "last": "Elliott",
                    "suffix": ""
                },
                {
                    "first": "CS",
                    "middle": [],
                    "last": "Schmaljohn",
                    "suffix": ""
                },
                {
                    "first": "MS",
                    "middle": [],
                    "last": "Collett",
                    "suffix": ""
                }
            ],
            "year": 1991,
            "venue": "Curr Top Microbiol Immunol",
            "volume": "169",
            "issn": "",
            "pages": "91-141",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF12": {
            "title": "Experimental transmission of Crimean-Congo hemorrhagic fever virus by Hyalomma truncatum Koch",
            "authors": [
                {
                    "first": "TM",
                    "middle": [],
                    "last": "Logan",
                    "suffix": ""
                },
                {
                    "first": "KJ",
                    "middle": [],
                    "last": "Linthicum",
                    "suffix": ""
                },
                {
                    "first": "CL",
                    "middle": [],
                    "last": "Bailey",
                    "suffix": ""
                },
                {
                    "first": "DM",
                    "middle": [],
                    "last": "Watts",
                    "suffix": ""
                },
                {
                    "first": "JR",
                    "middle": [],
                    "last": "Moulton",
                    "suffix": ""
                }
            ],
            "year": 1989,
            "venue": "Am J Trop Med Hyg",
            "volume": "40",
            "issn": "",
            "pages": "207-212",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF13": {
            "title": "Molecular detection of pathogen DNA in ticks (Acari: Ixodidae): a review",
            "authors": [
                {
                    "first": "OA",
                    "middle": [],
                    "last": "Sparagano",
                    "suffix": ""
                },
                {
                    "first": "MT",
                    "middle": [],
                    "last": "Allsopp",
                    "suffix": ""
                },
                {
                    "first": "RA",
                    "middle": [],
                    "last": "Mank",
                    "suffix": ""
                },
                {
                    "first": "SG",
                    "middle": [],
                    "last": "Rijpkema",
                    "suffix": ""
                },
                {
                    "first": "JV",
                    "middle": [],
                    "last": "Figueroa",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Jongejan",
                    "suffix": ""
                }
            ],
            "year": 1999,
            "venue": "Exp Appl Acarol",
            "volume": "23",
            "issn": "",
            "pages": "929-960",
            "other_ids": {
                "DOI": [
                    "10.1023/A:1006313803979"
                ]
            }
        },
        "BIBREF14": {
            "title": "Experimental transmission of Crimean-Congo hemorrhagic fever virus by west African wild ground-feeding birds to Hyalomma marginatum rufipes ticks",
            "authors": [
                {
                    "first": "HG",
                    "middle": [],
                    "last": "Zeller",
                    "suffix": ""
                },
                {
                    "first": "JP",
                    "middle": [],
                    "last": "Cornet",
                    "suffix": ""
                },
                {
                    "first": "JL",
                    "middle": [],
                    "last": "Camicas",
                    "suffix": ""
                }
            ],
            "year": 1994,
            "venue": "Am J Trop Med Hyg",
            "volume": "50",
            "issn": "",
            "pages": "676-681",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF15": {
            "title": "Experimantal Congo virus (Ib -AN 7620) infection in primates",
            "authors": [
                {
                    "first": "AH",
                    "middle": [],
                    "last": "Fagbami",
                    "suffix": ""
                },
                {
                    "first": "O",
                    "middle": [],
                    "last": "Tomori",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Fabiyi",
                    "suffix": ""
                },
                {
                    "first": "TT",
                    "middle": [],
                    "last": "Isoun",
                    "suffix": ""
                }
            ],
            "year": 1975,
            "venue": "Virologie",
            "volume": "26",
            "issn": "",
            "pages": "33-37",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF16": {
            "title": "Experimental infection of ostriches with Crimean-Congo haemorrhagic fever virus",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Swanepoel",
                    "suffix": ""
                },
                {
                    "first": "PA",
                    "middle": [],
                    "last": "Leman",
                    "suffix": ""
                },
                {
                    "first": "FJ",
                    "middle": [],
                    "last": "Burt",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Jardine",
                    "suffix": ""
                },
                {
                    "first": "DJ",
                    "middle": [],
                    "last": "Verwoerd",
                    "suffix": ""
                },
                {
                    "first": "I",
                    "middle": [],
                    "last": "Capua",
                    "suffix": ""
                },
                {
                    "first": "GK",
                    "middle": [],
                    "last": "Bruckner",
                    "suffix": ""
                },
                {
                    "first": "WP",
                    "middle": [],
                    "last": "Burger",
                    "suffix": ""
                }
            ],
            "year": 1998,
            "venue": "Epidemiol Infect",
            "volume": "121",
            "issn": "",
            "pages": "427-432",
            "other_ids": {
                "DOI": [
                    "10.1017/S0950268898001344"
                ]
            }
        },
        "BIBREF17": {
            "title": "Risk of human infections with Crimean-Congo hemorrhagic fever virus in a South African rural community",
            "authors": [
                {
                    "first": "SP",
                    "middle": [],
                    "last": "Fisher-Hoch",
                    "suffix": ""
                },
                {
                    "first": "JB",
                    "middle": [],
                    "last": "McCormick",
                    "suffix": ""
                },
                {
                    "first": "R",
                    "middle": [],
                    "last": "Swanepoel",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Van Middlekoop",
                    "suffix": ""
                },
                {
                    "first": "S",
                    "middle": [],
                    "last": "Harvey",
                    "suffix": ""
                },
                {
                    "first": "HG",
                    "middle": [],
                    "last": "Kustner",
                    "suffix": ""
                }
            ],
            "year": 1992,
            "venue": "Am J Trop Med Hyg",
            "volume": "47",
            "issn": "",
            "pages": "337-345",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF18": {
            "title": "Exotic virus infections of military significance. Hemorrhagic fever viruses and pox virus infections",
            "authors": [
                {
                    "first": "DL",
                    "middle": [],
                    "last": "Mayers",
                    "suffix": ""
                }
            ],
            "year": 1999,
            "venue": "Dermatol Clin",
            "volume": "17",
            "issn": "",
            "pages": "29-40, vii-viii",
            "other_ids": {
                "DOI": [
                    "10.1016/S0738-081X(98)00065-0"
                ]
            }
        },
        "BIBREF19": {
            "title": "Crimean-Congo hemorrhagic fever virus glycoprotein proteolytic processing by subtilase SKI-1",
            "authors": [
                {
                    "first": "MJ",
                    "middle": [],
                    "last": "Vincent",
                    "suffix": ""
                },
                {
                    "first": "AJ",
                    "middle": [],
                    "last": "Sanchez",
                    "suffix": ""
                },
                {
                    "first": "BR",
                    "middle": [],
                    "last": "Erickson",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Basak",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Chretien",
                    "suffix": ""
                },
                {
                    "first": "NG",
                    "middle": [],
                    "last": "Seidah",
                    "suffix": ""
                },
                {
                    "first": "ST",
                    "middle": [],
                    "last": "Nichol",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "J Virol",
            "volume": "77",
            "issn": "",
            "pages": "8640-8649",
            "other_ids": {
                "DOI": [
                    "10.1128/JVI.77.16.8640-8649.2003"
                ]
            }
        },
        "BIBREF20": {
            "title": "The Lassa virus glycoprotein precursor GP-C is proteolytically processed by subtilase SKI-1/S1P",
            "authors": [
                {
                    "first": "O",
                    "middle": [],
                    "last": "Lenz",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "ter Meulen",
                    "suffix": ""
                },
                {
                    "first": "HD",
                    "middle": [],
                    "last": "Klenk",
                    "suffix": ""
                },
                {
                    "first": "NG",
                    "middle": [],
                    "last": "Seidah",
                    "suffix": ""
                },
                {
                    "first": "W",
                    "middle": [],
                    "last": "Garten",
                    "suffix": ""
                }
            ],
            "year": 2001,
            "venue": "Proc Natl Acad Sci U S A",
            "volume": "98",
            "issn": "",
            "pages": "12701-12705",
            "other_ids": {
                "DOI": [
                    "10.1073/pnas.221447598"
                ]
            }
        },
        "BIBREF21": {
            "title": "A retention signal necessary and sufficient for Golgi localization maps to the cytoplasmic tail of a Bunyaviridae (Uukuniemi virus) membrane glycoprotein",
            "authors": [
                {
                    "first": "AM",
                    "middle": [],
                    "last": "Andersson",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Melin",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Bean",
                    "suffix": ""
                },
                {
                    "first": "RF",
                    "middle": [],
                    "last": "Pettersson",
                    "suffix": ""
                }
            ],
            "year": 1997,
            "venue": "J Virol",
            "volume": "71",
            "issn": "",
            "pages": "4717-4727",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF22": {
            "title": "Bunyaviridae",
            "authors": [
                {
                    "first": "CS",
                    "middle": [],
                    "last": "Schmaljohn",
                    "suffix": ""
                },
                {
                    "first": "JW",
                    "middle": [],
                    "last": "Le Duc",
                    "suffix": ""
                }
            ],
            "year": 1998,
            "venue": "Topley and Wilson's Microbiology and Microbial Infections",
            "volume": "",
            "issn": "",
            "pages": "601-628",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF23": {
            "title": "Targeting of a short peptide derived from the cytoplasmic tail of the G1 membrane glycoprotein of Uukuniemi virus (Bunyaviridae) to the Golgi complex",
            "authors": [
                {
                    "first": "AM",
                    "middle": [],
                    "last": "Andersson",
                    "suffix": ""
                },
                {
                    "first": "RF",
                    "middle": [],
                    "last": "Pettersson",
                    "suffix": ""
                }
            ],
            "year": 1998,
            "venue": "J Virol",
            "volume": "72",
            "issn": "",
            "pages": "9585-9596",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF24": {
            "title": "Oligomerization, transport, and Golgi retention of Punta Toro virus glycoproteins",
            "authors": [
                {
                    "first": "SY",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "RW",
                    "middle": [],
                    "last": "Compans",
                    "suffix": ""
                }
            ],
            "year": 1991,
            "venue": "J Virol",
            "volume": "65",
            "issn": "",
            "pages": "5902-5909",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF25": {
            "title": "Golgi complex localization of the Punta Toro virus G2 protein requires its association with the G1 protein",
            "authors": [
                {
                    "first": "SY",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Matsuoka",
                    "suffix": ""
                },
                {
                    "first": "RW",
                    "middle": [],
                    "last": "Compans",
                    "suffix": ""
                }
            ],
            "year": 1991,
            "venue": "Virology",
            "volume": "183",
            "issn": "",
            "pages": "351-365",
            "other_ids": {
                "DOI": [
                    "10.1016/0042-6822(91)90148-5"
                ]
            }
        },
        "BIBREF26": {
            "title": "Characterization of the Golgi retention motif of Rift Valley fever virus G(N) glycoprotein",
            "authors": [
                {
                    "first": "SR",
                    "middle": [],
                    "last": "Gerrard",
                    "suffix": ""
                },
                {
                    "first": "ST",
                    "middle": [],
                    "last": "Nichol",
                    "suffix": ""
                }
            ],
            "year": 2002,
            "venue": "J Virol",
            "volume": "76",
            "issn": "",
            "pages": "12200-12210",
            "other_ids": {
                "DOI": [
                    "10.1128/JVI.76.23.12200-12210.2002"
                ]
            }
        },
        "BIBREF27": {
            "title": "Localization of Bunyamwera bunyavirus G1 glycoprotein to the Golgi requires association with G2 but not with NSm",
            "authors": [
                {
                    "first": "DF",
                    "middle": [],
                    "last": "Lappin",
                    "suffix": ""
                },
                {
                    "first": "GW",
                    "middle": [],
                    "last": "Nakitare",
                    "suffix": ""
                },
                {
                    "first": "JW",
                    "middle": [],
                    "last": "Palfreyman",
                    "suffix": ""
                },
                {
                    "first": "RM",
                    "middle": [],
                    "last": "Elliott",
                    "suffix": ""
                }
            ],
            "year": 1994,
            "venue": "J Gen Virol",
            "volume": "75 ( Pt 12)",
            "issn": "",
            "pages": "3441-3451",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF28": {
            "title": "A signal for Golgi retention in the bunyavirus G1 glycoprotein",
            "authors": [
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Matsuoka",
                    "suffix": ""
                },
                {
                    "first": "SY",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "RW",
                    "middle": [],
                    "last": "Compans",
                    "suffix": ""
                }
            ],
            "year": 1994,
            "venue": "J Biol Chem",
            "volume": "269",
            "issn": "",
            "pages": "22565-22573",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF29": {
            "title": "Molecular determinants of Golgi retention in the Punta Toro virus G1 protein",
            "authors": [
                {
                    "first": "Y",
                    "middle": [],
                    "last": "Matsuoka",
                    "suffix": ""
                },
                {
                    "first": "SY",
                    "middle": [],
                    "last": "Chen",
                    "suffix": ""
                },
                {
                    "first": "CE",
                    "middle": [],
                    "last": "Holland",
                    "suffix": ""
                },
                {
                    "first": "RW",
                    "middle": [],
                    "last": "Compans",
                    "suffix": ""
                }
            ],
            "year": 1996,
            "venue": "Arch Biochem Biophys",
            "volume": "336",
            "issn": "",
            "pages": "184-189",
            "other_ids": {
                "DOI": [
                    "10.1006/abbi.1996.0547"
                ]
            }
        },
        "BIBREF30": {
            "title": "Mapping a retention signal for Golgi localization of a viral spike protein complex",
            "authors": [
                {
                    "first": "RF",
                    "middle": [],
                    "last": "Pettersson",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Andersson",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Melin",
                    "suffix": ""
                }
            ],
            "year": 1995,
            "venue": "Cold Spring Harb Symp Quant Biol",
            "volume": "60",
            "issn": "",
            "pages": "147-155",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF31": {
            "title": "Mapping the Golgi targeting and retention signal of Bunyamwera virus glycoproteins",
            "authors": [
                {
                    "first": "X",
                    "middle": [],
                    "last": "Shi",
                    "suffix": ""
                },
                {
                    "first": "DF",
                    "middle": [],
                    "last": "Lappin",
                    "suffix": ""
                },
                {
                    "first": "RM",
                    "middle": [],
                    "last": "Elliott",
                    "suffix": ""
                }
            ],
            "year": 2004,
            "venue": "J Virol",
            "volume": "78",
            "issn": "",
            "pages": "10793-10802",
            "other_ids": {
                "DOI": [
                    "10.1128/JVI.78.19.10793-10802.2004"
                ]
            }
        },
        "BIBREF32": {
            "title": "Sin Nombre virus glycoprotein trafficking",
            "authors": [
                {
                    "first": "CF",
                    "middle": [],
                    "last": "Spiropoulou",
                    "suffix": ""
                },
                {
                    "first": "CS",
                    "middle": [],
                    "last": "Goldsmith",
                    "suffix": ""
                },
                {
                    "first": "TR",
                    "middle": [],
                    "last": "Shoemaker",
                    "suffix": ""
                },
                {
                    "first": "CJ",
                    "middle": [],
                    "last": "Peters",
                    "suffix": ""
                },
                {
                    "first": "RW",
                    "middle": [],
                    "last": "Compans",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "Virology",
            "volume": "308",
            "issn": "",
            "pages": "48-63",
            "other_ids": {
                "DOI": [
                    "10.1016/S0042-6822(02)00092-2"
                ]
            }
        },
        "BIBREF33": {
            "title": "Bunyaviridae: the viruses and their replication",
            "authors": [
                {
                    "first": "CS",
                    "middle": [],
                    "last": "Schmaljohn",
                    "suffix": ""
                },
                {
                    "first": "JW",
                    "middle": [],
                    "last": "Hooper",
                    "suffix": ""
                }
            ],
            "year": 2001,
            "venue": "Fields virology",
            "volume": "",
            "issn": "",
            "pages": "1581-1602",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF34": {
            "title": "Mutational analysis of the Uukuniemi virus (Bunyaviridae family) promoter reveals two elements of functional importance",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Flick",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Elgh",
                    "suffix": ""
                },
                {
                    "first": "RF",
                    "middle": [],
                    "last": "Pettersson",
                    "suffix": ""
                }
            ],
            "year": 2002,
            "venue": "J Virol",
            "volume": "76",
            "issn": "",
            "pages": "10849-10860",
            "other_ids": {
                "DOI": [
                    "10.1128/JVI.76.21.10849-10860.2002"
                ]
            }
        },
        "BIBREF35": {
            "title": "Reverse genetics for crimean-congo hemorrhagic fever virus",
            "authors": [
                {
                    "first": "R",
                    "middle": [],
                    "last": "Flick",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Flick",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Feldmann",
                    "suffix": ""
                },
                {
                    "first": "F",
                    "middle": [],
                    "last": "Elgh",
                    "suffix": ""
                }
            ],
            "year": 2003,
            "venue": "J Virol",
            "volume": "77",
            "issn": "",
            "pages": "5997-6006",
            "other_ids": {
                "DOI": [
                    "10.1128/JVI.77.10.5997-6006.2003"
                ]
            }
        },
        "BIBREF36": {
            "title": "Herpesvirus assembly and egress",
            "authors": [
                {
                    "first": "TC",
                    "middle": [],
                    "last": "Mettenleiter",
                    "suffix": ""
                }
            ],
            "year": 2002,
            "venue": "J Virol",
            "volume": "76",
            "issn": "",
            "pages": "1537-1547",
            "other_ids": {
                "DOI": [
                    "10.1128/JVI.76.4.1537-1547.2002"
                ]
            }
        },
        "BIBREF37": {
            "title": "Markers for trans-Golgi membranes and the intermediate compartment localize to induced membranes with distinct replication functions in flavivirus-infected cells",
            "authors": [
                {
                    "first": "JM",
                    "middle": [],
                    "last": "Mackenzie",
                    "suffix": ""
                },
                {
                    "first": "MK",
                    "middle": [],
                    "last": "Jones",
                    "suffix": ""
                },
                {
                    "first": "EG",
                    "middle": [],
                    "last": "Westaway",
                    "suffix": ""
                }
            ],
            "year": 1999,
            "venue": "J Virol",
            "volume": "73",
            "issn": "",
            "pages": "9555-9567",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF38": {
            "title": "A hypothesis about the mechanism of assembly of double-shelled rotavirus particles",
            "authors": [
                {
                    "first": "H",
                    "middle": [],
                    "last": "Suzuki",
                    "suffix": ""
                }
            ],
            "year": 1996,
            "venue": "Arch Virol Suppl",
            "volume": "12",
            "issn": "",
            "pages": "79-85",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF39": {
            "title": "Characterization of the budding compartment of mouse hepatitis virus: evidence that transport from the RER to the Golgi complex requires only one vesicular transport step",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Krijnse-Locker",
                    "suffix": ""
                },
                {
                    "first": "M",
                    "middle": [],
                    "last": "Ericsson",
                    "suffix": ""
                },
                {
                    "first": "PJ",
                    "middle": [],
                    "last": "Rottier",
                    "suffix": ""
                },
                {
                    "first": "G",
                    "middle": [],
                    "last": "Griffiths",
                    "suffix": ""
                }
            ],
            "year": 1994,
            "venue": "J Cell Biol",
            "volume": "124",
            "issn": "",
            "pages": "55-70",
            "other_ids": {
                "DOI": [
                    "10.1083/jcb.124.1.55"
                ]
            }
        },
        "BIBREF40": {
            "title": "Poxviridae: the viruses and their replication",
            "authors": [
                {
                    "first": "B",
                    "middle": [],
                    "last": "Moss",
                    "suffix": ""
                }
            ],
            "year": 2001,
            "venue": "Fields virology",
            "volume": "",
            "issn": "",
            "pages": "2849-2871",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF41": {
            "title": "Immunoisolation and characterization of a subdomain of the endoplasmic reticulum that concentrates proteins involved in COPII vesicle biogenesis",
            "authors": [
                {
                    "first": "TC",
                    "middle": [],
                    "last": "Hobman",
                    "suffix": ""
                },
                {
                    "first": "B",
                    "middle": [],
                    "last": "Zhao",
                    "suffix": ""
                },
                {
                    "first": "H",
                    "middle": [],
                    "last": "Chan",
                    "suffix": ""
                },
                {
                    "first": "MG",
                    "middle": [],
                    "last": "Farquhar",
                    "suffix": ""
                }
            ],
            "year": 1998,
            "venue": "Mol Biol Cell",
            "volume": "9",
            "issn": "",
            "pages": "1265-1278",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF42": {
            "title": "Identification of a consensus motif for retention of transmembrane proteins in the endoplasmic reticulum",
            "authors": [
                {
                    "first": "MR",
                    "middle": [],
                    "last": "Jackson",
                    "suffix": ""
                },
                {
                    "first": "T",
                    "middle": [],
                    "last": "Nilsson",
                    "suffix": ""
                },
                {
                    "first": "PA",
                    "middle": [],
                    "last": "Peterson",
                    "suffix": ""
                }
            ],
            "year": 1990,
            "venue": "Embo J",
            "volume": "9",
            "issn": "",
            "pages": "3153-3162",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF43": {
            "title": "The rubella virus E1 glycoprotein is arrested in a novel post-ER, pre-Golgi compartment",
            "authors": [
                {
                    "first": "TC",
                    "middle": [],
                    "last": "Hobman",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Woodward",
                    "suffix": ""
                },
                {
                    "first": "MG",
                    "middle": [],
                    "last": "Farquhar",
                    "suffix": ""
                }
            ],
            "year": 1992,
            "venue": "J Cell Biol",
            "volume": "118",
            "issn": "",
            "pages": "795-811",
            "other_ids": {
                "DOI": [
                    "10.1083/jcb.118.4.795"
                ]
            }
        },
        "BIBREF44": {
            "title": "Characterization of the glycoproteins of Crimean-Congo hemorrhagic fever virus",
            "authors": [
                {
                    "first": "AJ",
                    "middle": [],
                    "last": "Sanchez",
                    "suffix": ""
                },
                {
                    "first": "MJ",
                    "middle": [],
                    "last": "Vincent",
                    "suffix": ""
                },
                {
                    "first": "ST",
                    "middle": [],
                    "last": "Nichol",
                    "suffix": ""
                }
            ],
            "year": 2002,
            "venue": "J Virol",
            "volume": "76",
            "issn": "",
            "pages": "7263-7275",
            "other_ids": {
                "DOI": [
                    "10.1128/JVI.76.14.7263-7275.2002"
                ]
            }
        },
        "BIBREF45": {
            "title": "The rubella virus E2 and E1 spike glycoproteins are targeted to the Golgi complex",
            "authors": [
                {
                    "first": "TC",
                    "middle": [],
                    "last": "Hobman",
                    "suffix": ""
                },
                {
                    "first": "L",
                    "middle": [],
                    "last": "Woodward",
                    "suffix": ""
                },
                {
                    "first": "MG",
                    "middle": [],
                    "last": "Farquhar",
                    "suffix": ""
                }
            ],
            "year": 1993,
            "venue": "J Cell Biol",
            "volume": "121",
            "issn": "",
            "pages": "269-281",
            "other_ids": {
                "DOI": [
                    "10.1083/jcb.121.2.269"
                ]
            }
        },
        "BIBREF46": {
            "title": "Efficient selection for high-expression transfectants with a novel eukaryotic vector",
            "authors": [
                {
                    "first": "H",
                    "middle": [],
                    "last": "Niwa",
                    "suffix": ""
                },
                {
                    "first": "K",
                    "middle": [],
                    "last": "Yamamura",
                    "suffix": ""
                },
                {
                    "first": "J",
                    "middle": [],
                    "last": "Miyazaki",
                    "suffix": ""
                }
            ],
            "year": 1991,
            "venue": "Gene",
            "volume": "108",
            "issn": "",
            "pages": "193-199",
            "other_ids": {
                "DOI": [
                    "10.1016/0378-1119(91)90434-D"
                ]
            }
        },
        "BIBREF47": {
            "title": "Identification of the Ebola virus glycoprotein as the main viral determinant of vascular cell cytotoxicity and injury",
            "authors": [
                {
                    "first": "ZY",
                    "middle": [],
                    "last": "Yang",
                    "suffix": ""
                },
                {
                    "first": "HJ",
                    "middle": [],
                    "last": "Duckers",
                    "suffix": ""
                },
                {
                    "first": "NJ",
                    "middle": [],
                    "last": "Sullivan",
                    "suffix": ""
                },
                {
                    "first": "A",
                    "middle": [],
                    "last": "Sanchez",
                    "suffix": ""
                },
                {
                    "first": "EG",
                    "middle": [],
                    "last": "Nabel",
                    "suffix": ""
                },
                {
                    "first": "GJ",
                    "middle": [],
                    "last": "Nabel",
                    "suffix": ""
                }
            ],
            "year": 2000,
            "venue": "Nat Med",
            "volume": "6",
            "issn": "",
            "pages": "886-889",
            "other_ids": {
                "DOI": [
                    "10.1038/78645"
                ]
            }
        },
        "BIBREF48": {
            "title": "Antigenic similarity between the virus causing Crimean hemorrhagic fever and Congo virus",
            "authors": [
                {
                    "first": "J",
                    "middle": [],
                    "last": "Casals",
                    "suffix": ""
                }
            ],
            "year": 1969,
            "venue": "Proc Soc Exp Biol Med",
            "volume": "131",
            "issn": "",
            "pages": "233-236",
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF49": {
            "title": "A new tick-borne disease-Crimean hemorrhagic fever",
            "authors": [
                {
                    "first": "MP",
                    "middle": [],
                    "last": "Chumakov",
                    "suffix": ""
                }
            ],
            "year": 1945,
            "venue": "Crimean Hemorrhagic Fever (Acute Infectious Capillary Toxicosis)",
            "volume": "",
            "issn": "",
            "pages": null,
            "other_ids": {
                "DOI": []
            }
        },
        "BIBREF50": {
            "title": "Contribution to 30 years of investigation of Crimean haemorrhagic fever",
            "authors": [
                {
                    "first": "MP",
                    "middle": [],
                    "last": "Chumakov",
                    "suffix": ""
                }
            ],
            "year": 1974,
            "venue": "Med Virol",
            "volume": "22",
            "issn": "",
            "pages": "5-18",
            "other_ids": {
                "DOI": []
            }
        }
    }
}